{
    "text": "In my former book, Theophilus, I wrote about all that Jesus began to do and to teach until the day he was taken up to heaven, after giving instructions through the Holy Spirit to the apostles he had chosen. After his suffering, he presented himself to them and gave many convincing proofs that he was alive. He appeared to them over a period of forty days and spoke about the kingdom of God. On one occasion, while he was eating with them, he gave them this command: “Do not leave Jerusalem, but wait for the gift my Father promised, which you have heard me speak about. For John baptized with water, but in a few days you will be baptized with the Holy Spirit.” Then they gathered around him and asked him, “Lord, are you at this time going to restore the kingdom to Israel?” He said to them: “It is not for you to know the times or dates the Father has set by his own authority. But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.” After he said this, he was taken up before their very eyes, and a cloud hid him from their sight. They were looking intently up into the sky as he was going, when suddenly two men dressed in white stood beside them. “Men of Galilee,” they said, “why do you stand here looking into the sky? This same Jesus, who has been taken from you into heaven, will come back in the same way you have seen him go into heaven.” Then the apostles returned to Jerusalem from the hill called the Mount of Olives, a Sabbath day’s walk from the city. When they arrived, they went upstairs to the room where they were staying. Those present were Peter, John, James and Andrew; Philip and Thomas, Bartholomew and Matthew; James son of Alphaeus and Simon the Zealot, and Judas son of James. They all joined together constantly in prayer, along with the women and Mary the mother of Jesus, and with his brothers. In those days Peter stood up among the believers (a group numbering about a hundred and twenty) and said, “Brothers and sisters, the Scripture had to be fulfilled in which the Holy Spirit spoke long ago through David concerning Judas, who served as guide for those who arrested Jesus. He was one of our number and shared in our ministry.” (With the payment he received for his wickedness, Judas bought a field; there he fell headlong, his body burst open and all his intestines spilled out. Everyone in Jerusalem heard about this, so they called that field in their language Akeldama, that is, Field of Blood.) “For,” said Peter, “it is written in the Book of Psalms:\n“‘May his place be deserted;\n    let there be no one to dwell in it,’\nand,\n“‘May another take his place of leadership.’ Therefore it is necessary to choose one of the men who have been with us the whole time the Lord Jesus was living among us, beginning from John’s baptism to the time when Jesus was taken up from us. For one of these must become a witness with us of his resurrection.” So they nominated two men: Joseph called Barsabbas (also known as Justus) and Matthias. Then they prayed, “Lord, you know everyone’s heart. Show us which of these two you have chosen to take over this apostolic ministry, which Judas left to go where he belongs.” Then they cast lots, and the lot fell to Matthias; so he was added to the eleven apostles. \n\nWhen the day of Pentecost came, they were all together in one place. Suddenly a sound like the blowing of a violent wind came from heaven and filled the whole house where they were sitting. They saw what seemed to be tongues of fire that separated and came to rest on each of them. All of them were filled with the Holy Spirit and began to speak in other tongues as the Spirit enabled them. Now there were staying in Jerusalem God-fearing Jews from every nation under heaven. When they heard this sound, a crowd came together in bewilderment, because each one heard their own language being spoken. Utterly amazed, they asked: “Aren’t all these who are speaking Galileans? Then how is it that each of us hears them in our native language? Parthians, Medes and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia, Phrygia and Pamphylia, Egypt and the parts of Libya near Cyrene; visitors from Rome (both Jews and converts to Judaism); Cretans and Arabs—we hear them declaring the wonders of God in our own tongues!” Amazed and perplexed, they asked one another, “What does this mean?” Some, however, made fun of them and said, “They have had too much wine.” Then Peter stood up with the Eleven, raised his voice and addressed the crowd: “Fellow Jews and all of you who live in Jerusalem, let me explain this to you; listen carefully to what I say. These people are not drunk, as you suppose. It’s only nine in the morning! No, this is what was spoken by the prophet Joel: “‘In the last days, God says,\n    I will pour out my Spirit on all people.\nYour sons and daughters will prophesy,\n    your young men will see visions,\n    your old men will dream dreams. Even on my servants, both men and women,\n    I will pour out my Spirit in those days,\n    and they will prophesy. I will show wonders in the heavens above\n    and signs on the earth below,\n    blood and fire and billows of smoke. The sun will be turned to darkness\n    and the moon to blood\n    before the coming of the great and glorious day of the Lord. And everyone who calls\n    on the name of the Lord will be saved.’ “Fellow Israelites, listen to this: Jesus of Nazareth was a man accredited by God to you by miracles, wonders and signs, which God did among you through him, as you yourselves know. This man was handed over to you by God’s deliberate plan and foreknowledge; and you, with the help of wicked men, put him to death by nailing him to the cross. But God raised him from the dead, freeing him from the agony of death, because it was impossible for death to keep its hold on him. David said about him:\n“‘I saw the Lord always before me.\n    Because he is at my right hand,\n    I will not be shaken. Therefore my heart is glad and my tongue rejoices;\n    my body also will rest in hope, because you will not abandon me to the realm of the dead,\n    you will not let your holy one see decay. You have made known to me the paths of life;\n    you will fill me with joy in your presence.’ “Fellow Israelites, I can tell you confidently that the patriarch David died and was buried, and his tomb is here to this day. But he was a prophet and knew that God had promised him on oath that he would place one of his descendants on his throne. Seeing what was to come, he spoke of the resurrection of the Messiah, that he was not abandoned to the realm of the dead, nor did his body see decay. God has raised this Jesus to life, and we are all witnesses of it. Exalted to the right hand of God, he has received from the Father the promised Holy Spirit and has poured out what you now see and hear. For David did not ascend to heaven, and yet he said,\n“‘The Lord said to my Lord:\n    “Sit at my right hand until I make your enemies\n    a footstool for your feet.”’ “Therefore let all Israel be assured of this: God has made this Jesus, whom you crucified, both Lord and Messiah.” When the people heard this, they were cut to the heart and said to Peter and the other apostles, “Brothers, what shall we do?” Peter replied, “Repent and be baptized, every one of you, in the name of Jesus Christ for the forgiveness of your sins. And you will receive the gift of the Holy Spirit. The promise is for you and your children and for all who are far off—for all whom the Lord our God will call.” With many other words he warned them; and he pleaded with them, “Save yourselves from this corrupt generation.” Those who accepted his message were baptized, and about three thousand were added to their number that day. They devoted themselves to the apostles’ teaching and to fellowship, to the breaking of bread and to prayer. Everyone was filled with awe at the many wonders and signs performed by the apostles. All the believers were together and had everything in common. They sold property and possessions to give to anyone who had need. Every day they continued to meet together in the temple courts. They broke bread in their homes and ate together with glad and sincere hearts, praising God and enjoying the favor of all the people. And the Lord added to their number daily those who were being saved. \n\nOne day Peter and John were going up to the temple at the time of prayer—at three in the afternoon. Now a man who was lame from birth was being carried to the temple gate called Beautiful, where he was put every day to beg from those going into the temple courts. When he saw Peter and John about to enter, he asked them for money. Peter looked straight at him, as did John. Then Peter said, “Look at us!” So the man gave them his attention, expecting to get something from them. Then Peter said, “Silver or gold I do not have, but what I do have I give you. In the name of Jesus Christ of Nazareth, walk.” Taking him by the right hand, he helped him up, and instantly the man’s feet and ankles became strong. He jumped to his feet and began to walk. Then he went with them into the temple courts, walking and jumping, and praising God. When all the people saw him walking and praising God, they recognized him as the same man who used to sit begging at the temple gate called Beautiful, and they were filled with wonder and amazement at what had happened to him. While the man held on to Peter and John, all the people were astonished and came running to them in the place called Solomon’s Colonnade. When Peter saw this, he said to them: “Fellow Israelites, why does this surprise you? Why do you stare at us as if by our own power or godliness we had made this man walk? The God of Abraham, Isaac and Jacob, the God of our fathers, has glorified his servant Jesus. You handed him over to be killed, and you disowned him before Pilate, though he had decided to let him go. You disowned the Holy and Righteous One and asked that a murderer be released to you. You killed the author of life, but God raised him from the dead. We are witnesses of this. By faith in the name of Jesus, this man whom you see and know was made strong. It is Jesus’ name and the faith that comes through him that has completely healed him, as you can all see. “Now, fellow Israelites, I know that you acted in ignorance, as did your leaders. But this is how God fulfilled what he had foretold through all the prophets, saying that his Messiah would suffer. Repent, then, and turn to God, so that your sins may be wiped out, that times of refreshing may come from the Lord, and that he may send the Messiah, who has been appointed for you—even Jesus. Heaven must receive him until the time comes for God to restore everything, as he promised long ago through his holy prophets. For Moses said, ‘The Lord your God will raise up for you a prophet like me from among your own people; you must listen to everything he tells you. Anyone who does not listen to him will be completely cut off from their people.’ “Indeed, beginning with Samuel, all the prophets who have spoken have foretold these days. And you are heirs of the prophets and of the covenant God made with your fathers. He said to Abraham, ‘Through your offspring all peoples on earth will be blessed.’ When God raised up his servant, he sent him first to you to bless you by turning each of you from your wicked ways.” \n\nThe priests and the captain of the temple guard and the Sadducees came up to Peter and John while they were speaking to the people. They were greatly disturbed because the apostles were teaching the people, proclaiming in Jesus the resurrection of the dead. They seized Peter and John and, because it was evening, they put them in jail until the next day. But many who heard the message believed; so the number of men who believed grew to about five thousand. The next day the rulers, the elders and the teachers of the law met in Jerusalem. Annas the high priest was there, and so were Caiaphas, John, Alexander and others of the high priest’s family. They had Peter and John brought before them and began to question them: “By what power or what name did you do this?” Then Peter, filled with the Holy Spirit, said to them: “Rulers and elders of the people! If we are being called to account today for an act of kindness shown to a man who was lame and are being asked how he was healed, then know this, you and all the people of Israel: It is by the name of Jesus Christ of Nazareth, whom you crucified but whom God raised from the dead, that this man stands before you healed. Jesus is\n“‘the stone you builders rejected,\n    which has become the cornerstone.’ Salvation is found in no one else, for there is no other name under heaven given to mankind by which we must be saved.” When they saw the courage of Peter and John and realized that they were unschooled, ordinary men, they were astonished and they took note that these men had been with Jesus. But since they could see the man who had been healed standing there with them, there was nothing they could say. So they ordered them to withdraw from the Sanhedrin and then conferred together. “What are we going to do with these men?” they asked. “Everyone living in Jerusalem knows they have performed a notable sign, and we cannot deny it. But to stop this thing from spreading any further among the people, we must warn them to speak no longer to anyone in this name.” Then they called them in again and commanded them not to speak or teach at all in the name of Jesus. But Peter and John replied, “Which is right in God’s eyes: to listen to you, or to him? You be the judges! As for us, we cannot help speaking about what we have seen and heard.” After further threats they let them go. They could not decide how to punish them, because all the people were praising God for what had happened. For the man who was miraculously healed was over forty years old. On their release, Peter and John went back to their own people and reported all that the chief priests and the elders had said to them. When they heard this, they raised their voices together in prayer to God. “Sovereign Lord,” they said, “you made the heavens and the earth and the sea, and everything in them. You spoke by the Holy Spirit through the mouth of your servant, our father David:\n“‘Why do the nations rage\n    and the peoples plot in vain? The kings of the earth rise up\n    and the rulers band together\nagainst the Lord\n    and against his anointed one.’ Indeed Herod and Pontius Pilate met together with the Gentiles and the people of Israel in this city to conspire against your holy servant Jesus, whom you anointed. They did what your power and will had decided beforehand should happen. Now, Lord, consider their threats and enable your servants to speak your word with great boldness. Stretch out your hand to heal and perform signs and wonders through the name of your holy servant Jesus.” After they prayed, the place where they were meeting was shaken. And they were all filled with the Holy Spirit and spoke the word of God boldly. All the believers were one in heart and mind. No one claimed that any of their possessions was their own, but they shared everything they had. With great power the apostles continued to testify to the resurrection of the Lord Jesus. And God’s grace was so powerfully at work in them all that there were no needy persons among them. For from time to time those who owned land or houses sold them, brought the money from the sales and put it at the apostles’ feet, and it was distributed to anyone who had need. Joseph, a Levite from Cyprus, whom the apostles called Barnabas (which means “son of encouragement”), sold a field he owned and brought the money and put it at the apostles’ feet. \n\nNow a man named Ananias, together with his wife Sapphira, also sold a piece of property. With his wife’s full knowledge he kept back part of the money for himself, but brought the rest and put it at the apostles’ feet. Then Peter said, “Ananias, how is it that Satan has so filled your heart that you have lied to the Holy Spirit and have kept for yourself some of the money you received for the land? Didn’t it belong to you before it was sold? And after it was sold, wasn’t the money at your disposal? What made you think of doing such a thing? You have not lied just to human beings but to God.” When Ananias heard this, he fell down and died. And great fear seized all who heard what had happened. Then some young men came forward, wrapped up his body, and carried him out and buried him. About three hours later his wife came in, not knowing what had happened. Peter asked her, “Tell me, is this the price you and Ananias got for the land?”\n“Yes,” she said, “that is the price.” Peter said to her, “How could you conspire to test the Spirit of the Lord? Listen! The feet of the men who buried your husband are at the door, and they will carry you out also.” At that moment she fell down at his feet and died. Then the young men came in and, finding her dead, carried her out and buried her beside her husband. Great fear seized the whole church and all who heard about these events. The apostles performed many signs and wonders among the people. And all the believers used to meet together in Solomon’s Colonnade. No one else dared join them, even though they were highly regarded by the people. Nevertheless, more and more men and women believed in the Lord and were added to their number. As a result, people brought the sick into the streets and laid them on beds and mats so that at least Peter’s shadow might fall on some of them as he passed by. Crowds gathered also from the towns around Jerusalem, bringing their sick and those tormented by impure spirits, and all of them were healed. Then the high priest and all his associates, who were members of the party of the Sadducees, were filled with jealousy. They arrested the apostles and put them in the public jail. But during the night an angel of the Lord opened the doors of the jail and brought them out. “Go, stand in the temple courts,” he said, “and tell the people all about this new life.” At daybreak they entered the temple courts, as they had been told, and began to teach the people.\nWhen the high priest and his associates arrived, they called together the Sanhedrin—the full assembly of the elders of Israel—and sent to the jail for the apostles. But on arriving at the jail, the officers did not find them there. So they went back and reported, “We found the jail securely locked, with the guards standing at the doors; but when we opened them, we found no one inside.” On hearing this report, the captain of the temple guard and the chief priests were at a loss, wondering what this might lead to. Then someone came and said, “Look! The men you put in jail are standing in the temple courts teaching the people.” At that, the captain went with his officers and brought the apostles. They did not use force, because they feared that the people would stone them. The apostles were brought in and made to appear before the Sanhedrin to be questioned by the high priest. “We gave you strict orders not to teach in this name,” he said. “Yet you have filled Jerusalem with your teaching and are determined to make us guilty of this man’s blood.” Peter and the other apostles replied: “We must obey God rather than human beings! The God of our ancestors raised Jesus from the dead—whom you killed by hanging him on a cross. God exalted him to his own right hand as Prince and Savior that he might bring Israel to repentance and forgive their sins. We are witnesses of these things, and so is the Holy Spirit, whom God has given to those who obey him.” When they heard this, they were furious and wanted to put them to death. But a Pharisee named Gamaliel, a teacher of the law, who was honored by all the people, stood up in the Sanhedrin and ordered that the men be put outside for a little while. Then he addressed the Sanhedrin: “Men of Israel, consider carefully what you intend to do to these men. Some time ago Theudas appeared, claiming to be somebody, and about four hundred men rallied to him. He was killed, all his followers were dispersed, and it all came to nothing. After him, Judas the Galilean appeared in the days of the census and led a band of people in revolt. He too was killed, and all his followers were scattered. Therefore, in the present case I advise you: Leave these men alone! Let them go! For if their purpose or activity is of human origin, it will fail. But if it is from God, you will not be able to stop these men; you will only find yourselves fighting against God.” His speech persuaded them. They called the apostles in and had them flogged. Then they ordered them not to speak in the name of Jesus, and let them go. The apostles left the Sanhedrin, rejoicing because they had been counted worthy of suffering disgrace for the Name. Day after day, in the temple courts and from house to house, they never stopped teaching and proclaiming the good news that Jesus is the Messiah. \n\nIn those days when the number of disciples was increasing, the Hellenistic Jews among them complained against the Hebraic Jews because their widows were being overlooked in the daily distribution of food. So the Twelve gathered all the disciples together and said, “It would not be right for us to neglect the ministry of the word of God in order to wait on tables. Brothers and sisters, choose seven men from among you who are known to be full of the Spirit and wisdom. We will turn this responsibility over to them and will give our attention to prayer and the ministry of the word.” This proposal pleased the whole group. They chose Stephen, a man full of faith and of the Holy Spirit; also Philip, Procorus, Nicanor, Timon, Parmenas, and Nicolas from Antioch, a convert to Judaism. They presented these men to the apostles, who prayed and laid their hands on them. So the word of God spread. The number of disciples in Jerusalem increased rapidly, and a large number of priests became obedient to the faith. Now Stephen, a man full of God’s grace and power, performed great wonders and signs among the people. Opposition arose, however, from members of the Synagogue of the Freedmen (as it was called)—Jews of Cyrene and Alexandria as well as the provinces of Cilicia and Asia—who began to argue with Stephen. But they could not stand up against the wisdom the Spirit gave him as he spoke. Then they secretly persuaded some men to say, “We have heard Stephen speak blasphemous words against Moses and against God.” So they stirred up the people and the elders and the teachers of the law. They seized Stephen and brought him before the Sanhedrin. They produced false witnesses, who testified, “This fellow never stops speaking against this holy place and against the law. For we have heard him say that this Jesus of Nazareth will destroy this place and change the customs Moses handed down to us.” All who were sitting in the Sanhedrin looked intently at Stephen, and they saw that his face was like the face of an angel. \n\nThen the high priest asked Stephen, “Are these charges true?” To this he replied: “Brothers and fathers, listen to me! The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he lived in Harran. ‘Leave your country and your people,’ God said, ‘and go to the land I will show you.’ “So he left the land of the Chaldeans and settled in Harran. After the death of his father, God sent him to this land where you are now living. He gave him no inheritance here, not even enough ground to set his foot on. But God promised him that he and his descendants after him would possess the land, even though at that time Abraham had no child. God spoke to him in this way: ‘For four hundred years your descendants will be strangers in a country not their own, and they will be enslaved and mistreated. But I will punish the nation they serve as slaves,’ God said, ‘and afterward they will come out of that country and worship me in this place.’ Then he gave Abraham the covenant of circumcision. And Abraham became the father of Isaac and circumcised him eight days after his birth. Later Isaac became the father of Jacob, and Jacob became the father of the twelve patriarchs. “Because the patriarchs were jealous of Joseph, they sold him as a slave into Egypt. But God was with him and rescued him from all his troubles. He gave Joseph wisdom and enabled him to gain the goodwill of Pharaoh king of Egypt. So Pharaoh made him ruler over Egypt and all his palace. “Then a famine struck all Egypt and Canaan, bringing great suffering, and our ancestors could not find food. When Jacob heard that there was grain in Egypt, he sent our forefathers on their first visit. On their second visit, Joseph told his brothers who he was, and Pharaoh learned about Joseph’s family. After this, Joseph sent for his father Jacob and his whole family, seventy-five in all. Then Jacob went down to Egypt, where he and our ancestors died. Their bodies were brought back to Shechem and placed in the tomb that Abraham had bought from the sons of Hamor at Shechem for a certain sum of money. “As the time drew near for God to fulfill his promise to Abraham, the number of our people in Egypt had greatly increased. Then ‘a new king, to whom Joseph meant nothing, came to power in Egypt.’ He dealt treacherously with our people and oppressed our ancestors by forcing them to throw out their newborn babies so that they would die. “At that time Moses was born, and he was no ordinary child. For three months he was cared for by his family. When he was placed outside, Pharaoh’s daughter took him and brought him up as her own son. Moses was educated in all the wisdom of the Egyptians and was powerful in speech and action. “When Moses was forty years old, he decided to visit his own people, the Israelites. He saw one of them being mistreated by an Egyptian, so he went to his defense and avenged him by killing the Egyptian. Moses thought that his own people would realize that God was using him to rescue them, but they did not. The next day Moses came upon two Israelites who were fighting. He tried to reconcile them by saying, ‘Men, you are brothers; why do you want to hurt each other?’ “But the man who was mistreating the other pushed Moses aside and said, ‘Who made you ruler and judge over us? Are you thinking of killing me as you killed the Egyptian yesterday?’ When Moses heard this, he fled to Midian, where he settled as a foreigner and had two sons. “After forty years had passed, an angel appeared to Moses in the flames of a burning bush in the desert near Mount Sinai. When he saw this, he was amazed at the sight. As he went over to get a closer look, he heard the Lord say: ‘I am the God of your fathers, the God of Abraham, Isaac and Jacob.’ Moses trembled with fear and did not dare to look. “Then the Lord said to him, ‘Take off your sandals, for the place where you are standing is holy ground. I have indeed seen the oppression of my people in Egypt. I have heard their groaning and have come down to set them free. Now come, I will send you back to Egypt.’ “This is the same Moses they had rejected with the words, ‘Who made you ruler and judge?’ He was sent to be their ruler and deliverer by God himself, through the angel who appeared to him in the bush. He led them out of Egypt and performed wonders and signs in Egypt, at the Red Sea and for forty years in the wilderness. “This is the Moses who told the Israelites, ‘God will raise up for you a prophet like me from your own people.’ He was in the assembly in the wilderness, with the angel who spoke to him on Mount Sinai, and with our ancestors; and he received living words to pass on to us. “But our ancestors refused to obey him. Instead, they rejected him and in their hearts turned back to Egypt. They told Aaron, ‘Make us gods who will go before us. As for this fellow Moses who led us out of Egypt—we don’t know what has happened to him!’ That was the time they made an idol in the form of a calf. They brought sacrifices to it and reveled in what their own hands had made. But God turned away from them and gave them over to the worship of the sun, moon and stars. This agrees with what is written in the book of the prophets:\n“‘Did you bring me sacrifices and offerings\n    forty years in the wilderness, people of Israel? You have taken up the tabernacle of Molek\n    and the star of your god Rephan,\n    the idols you made to worship.\nTherefore I will send you into exile’ beyond Babylon. “Our ancestors had the tabernacle of the covenant law with them in the wilderness. It had been made as God directed Moses, according to the pattern he had seen. After receiving the tabernacle, our ancestors under Joshua brought it with them when they took the land from the nations God drove out before them. It remained in the land until the time of David, who enjoyed God’s favor and asked that he might provide a dwelling place for the God of Jacob. But it was Solomon who built a house for him. “However, the Most High does not live in houses made by human hands. As the prophet says: “‘Heaven is my throne,\n    and the earth is my footstool.\nWhat kind of house will you build for me?\nsays the Lord.\n    Or where will my resting place be? Has not my hand made all these things?’ “You stiff-necked people! Your hearts and ears are still uncircumcised. You are just like your ancestors: You always resist the Holy Spirit! Was there ever a prophet your ancestors did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him— you who have received the law that was given through angels but have not obeyed it.” When the members of the Sanhedrin heard this, they were furious and gnashed their teeth at him. But Stephen, full of the Holy Spirit, looked up to heaven and saw the glory of God, and Jesus standing at the right hand of God. “Look,” he said, “I see heaven open and the Son of Man standing at the right hand of God.” At this they covered their ears and, yelling at the top of their voices, they all rushed at him, dragged him out of the city and began to stone him. Meanwhile, the witnesses laid their coats at the feet of a young man named Saul. While they were stoning him, Stephen prayed, “Lord Jesus, receive my spirit.” Then he fell on his knees and cried out, “Lord, do not hold this sin against them.” When he had said this, he fell asleep. \n\nAnd Saul approved of their killing him.\nOn that day a great persecution broke out against the church in Jerusalem, and all except the apostles were scattered throughout Judea and Samaria. Godly men buried Stephen and mourned deeply for him. But Saul began to destroy the church. Going from house to house, he dragged off both men and women and put them in prison. Those who had been scattered preached the word wherever they went. Philip went down to a city in Samaria and proclaimed the Messiah there. When the crowds heard Philip and saw the signs he performed, they all paid close attention to what he said. For with shrieks, impure spirits came out of many, and many who were paralyzed or lame were healed. So there was great joy in that city. Now for some time a man named Simon had practiced sorcery in the city and amazed all the people of Samaria. He boasted that he was someone great, and all the people, both high and low, gave him their attention and exclaimed, “This man is rightly called the Great Power of God.” They followed him because he had amazed them for a long time with his sorcery. But when they believed Philip as he proclaimed the good news of the kingdom of God and the name of Jesus Christ, they were baptized, both men and women. Simon himself believed and was baptized. And he followed Philip everywhere, astonished by the great signs and miracles he saw. When the apostles in Jerusalem heard that Samaria had accepted the word of God, they sent Peter and John to Samaria. When they arrived, they prayed for the new believers there that they might receive the Holy Spirit, because the Holy Spirit had not yet come on any of them; they had simply been baptized in the name of the Lord Jesus. Then Peter and John placed their hands on them, and they received the Holy Spirit. When Simon saw that the Spirit was given at the laying on of the apostles’ hands, he offered them money and said, “Give me also this ability so that everyone on whom I lay my hands may receive the Holy Spirit.” Peter answered: “May your money perish with you, because you thought you could buy the gift of God with money! You have no part or share in this ministry, because your heart is not right before God. Repent of this wickedness and pray to the Lord in the hope that he may forgive you for having such a thought in your heart. For I see that you are full of bitterness and captive to sin.” Then Simon answered, “Pray to the Lord for me so that nothing you have said may happen to me.” After they had further proclaimed the word of the Lord and testified about Jesus, Peter and John returned to Jerusalem, preaching the gospel in many Samaritan villages. Now an angel of the Lord said to Philip, “Go south to the road—the desert road—that goes down from Jerusalem to Gaza.” So he started out, and on his way he met an Ethiopian eunuch, an important official in charge of all the treasury of the Kandake (which means “queen of the Ethiopians”). This man had gone to Jerusalem to worship, and on his way home was sitting in his chariot reading the Book of Isaiah the prophet. The Spirit told Philip, “Go to that chariot and stay near it.” Then Philip ran up to the chariot and heard the man reading Isaiah the prophet. “Do you understand what you are reading?” Philip asked. “How can I,” he said, “unless someone explains it to me?” So he invited Philip to come up and sit with him. This is the passage of Scripture the eunuch was reading:\n“He was led like a sheep to the slaughter,\n    and as a lamb before its shearer is silent,\n    so he did not open his mouth. In his humiliation he was deprived of justice.\n    Who can speak of his descendants?\n    For his life was taken from the earth.” The eunuch asked Philip, “Tell me, please, who is the prophet talking about, himself or someone else?” Then Philip began with that very passage of Scripture and told him the good news about Jesus. As they traveled along the road, they came to some water and the eunuch said, “Look, here is water. What can stand in the way of my being baptized?”  And he gave orders to stop the chariot. Then both Philip and the eunuch went down into the water and Philip baptized him. When they came up out of the water, the Spirit of the Lord suddenly took Philip away, and the eunuch did not see him again, but went on his way rejoicing. Philip, however, appeared at Azotus and traveled about, preaching the gospel in all the towns until he reached Caesarea. \n\nMeanwhile, Saul was still breathing out murderous threats against the Lord’s disciples. He went to the high priest and asked him for letters to the synagogues in Damascus, so that if he found any there who belonged to the Way, whether men or women, he might take them as prisoners to Jerusalem. As he neared Damascus on his journey, suddenly a light from heaven flashed around him. He fell to the ground and heard a voice say to him, “Saul, Saul, why do you persecute me?” “Who are you, Lord?” Saul asked.\n“I am Jesus, whom you are persecuting,” he replied. “Now get up and go into the city, and you will be told what you must do.” The men traveling with Saul stood there speechless; they heard the sound but did not see anyone. Saul got up from the ground, but when he opened his eyes he could see nothing. So they led him by the hand into Damascus. For three days he was blind, and did not eat or drink anything. In Damascus there was a disciple named Ananias. The Lord called to him in a vision, “Ananias!”\n“Yes, Lord,” he answered. The Lord told him, “Go to the house of Judas on Straight Street and ask for a man from Tarsus named Saul, for he is praying. In a vision he has seen a man named Ananias come and place his hands on him to restore his sight.” “Lord,” Ananias answered, “I have heard many reports about this man and all the harm he has done to your holy people in Jerusalem. And he has come here with authority from the chief priests to arrest all who call on your name.” But the Lord said to Ananias, “Go! This man is my chosen instrument to proclaim my name to the Gentiles and their kings and to the people of Israel. I will show him how much he must suffer for my name.” Then Ananias went to the house and entered it. Placing his hands on Saul, he said, “Brother Saul, the Lord—Jesus, who appeared to you on the road as you were coming here—has sent me so that you may see again and be filled with the Holy Spirit.” Immediately, something like scales fell from Saul’s eyes, and he could see again. He got up and was baptized, and after taking some food, he regained his strength.\nSaul spent several days with the disciples in Damascus. At once he began to preach in the synagogues that Jesus is the Son of God. All those who heard him were astonished and asked, “Isn’t he the man who raised havoc in Jerusalem among those who call on this name? And hasn’t he come here to take them as prisoners to the chief priests?” Yet Saul grew more and more powerful and baffled the Jews living in Damascus by proving that Jesus is the Messiah. After many days had gone by, there was a conspiracy among the Jews to kill him, but Saul learned of their plan. Day and night they kept close watch on the city gates in order to kill him. But his followers took him by night and lowered him in a basket through an opening in the wall. When he came to Jerusalem, he tried to join the disciples, but they were all afraid of him, not believing that he really was a disciple. But Barnabas took him and brought him to the apostles. He told them how Saul on his journey had seen the Lord and that the Lord had spoken to him, and how in Damascus he had preached fearlessly in the name of Jesus. So Saul stayed with them and moved about freely in Jerusalem, speaking boldly in the name of the Lord. He talked and debated with the Hellenistic Jews, but they tried to kill him. When the believers learned of this, they took him down to Caesarea and sent him off to Tarsus. Then the church throughout Judea, Galilee and Samaria enjoyed a time of peace and was strengthened. Living in the fear of the Lord and encouraged by the Holy Spirit, it increased in numbers. As Peter traveled about the country, he went to visit the Lord’s people who lived in Lydda. There he found a man named Aeneas, who was paralyzed and had been bedridden for eight years. “Aeneas,” Peter said to him, “Jesus Christ heals you. Get up and roll up your mat.” Immediately Aeneas got up. All those who lived in Lydda and Sharon saw him and turned to the Lord. In Joppa there was a disciple named Tabitha (in Greek her name is Dorcas); she was always doing good and helping the poor. About that time she became sick and died, and her body was washed and placed in an upstairs room. Lydda was near Joppa; so when the disciples heard that Peter was in Lydda, they sent two men to him and urged him, “Please come at once!” Peter went with them, and when he arrived he was taken upstairs to the room. All the widows stood around him, crying and showing him the robes and other clothing that Dorcas had made while she was still with them. Peter sent them all out of the room; then he got down on his knees and prayed. Turning toward the dead woman, he said, “Tabitha, get up.” She opened her eyes, and seeing Peter she sat up. He took her by the hand and helped her to her feet. Then he called for the believers, especially the widows, and presented her to them alive. This became known all over Joppa, and many people believed in the Lord. Peter stayed in Joppa for some time with a tanner named Simon. \n\nAt Caesarea there was a man named Cornelius, a centurion in what was known as the Italian Regiment. He and all his family were devout and God-fearing; he gave generously to those in need and prayed to God regularly. One day at about three in the afternoon he had a vision. He distinctly saw an angel of God, who came to him and said, “Cornelius!” Cornelius stared at him in fear. “What is it, Lord?” he asked.\nThe angel answered, “Your prayers and gifts to the poor have come up as a memorial offering before God. Now send men to Joppa to bring back a man named Simon who is called Peter. He is staying with Simon the tanner, whose house is by the sea.” When the angel who spoke to him had gone, Cornelius called two of his servants and a devout soldier who was one of his attendants. He told them everything that had happened and sent them to Joppa. About noon the following day as they were on their journey and approaching the city, Peter went up on the roof to pray. He became hungry and wanted something to eat, and while the meal was being prepared, he fell into a trance. He saw heaven opened and something like a large sheet being let down to earth by its four corners. It contained all kinds of four-footed animals, as well as reptiles and birds. Then a voice told him, “Get up, Peter. Kill and eat.” “Surely not, Lord!” Peter replied. “I have never eaten anything impure or unclean.” The voice spoke to him a second time, “Do not call anything impure that God has made clean.” This happened three times, and immediately the sheet was taken back to heaven. While Peter was wondering about the meaning of the vision, the men sent by Cornelius found out where Simon’s house was and stopped at the gate. They called out, asking if Simon who was known as Peter was staying there. While Peter was still thinking about the vision, the Spirit said to him, “Simon, three men are looking for you. So get up and go downstairs. Do not hesitate to go with them, for I have sent them.” Peter went down and said to the men, “I’m the one you’re looking for. Why have you come?” The men replied, “We have come from Cornelius the centurion. He is a righteous and God-fearing man, who is respected by all the Jewish people. A holy angel told him to ask you to come to his house so that he could hear what you have to say.” Then Peter invited the men into the house to be his guests.\nThe next day Peter started out with them, and some of the believers from Joppa went along. The following day he arrived in Caesarea. Cornelius was expecting them and had called together his relatives and close friends. As Peter entered the house, Cornelius met him and fell at his feet in reverence. But Peter made him get up. “Stand up,” he said, “I am only a man myself.” While talking with him, Peter went inside and found a large gathering of people. He said to them: “You are well aware that it is against our law for a Jew to associate with or visit a Gentile. But God has shown me that I should not call anyone impure or unclean. So when I was sent for, I came without raising any objection. May I ask why you sent for me?” Cornelius answered: “Three days ago I was in my house praying at this hour, at three in the afternoon. Suddenly a man in shining clothes stood before me and said, ‘Cornelius, God has heard your prayer and remembered your gifts to the poor. Send to Joppa for Simon who is called Peter. He is a guest in the home of Simon the tanner, who lives by the sea.’ So I sent for you immediately, and it was good of you to come. Now we are all here in the presence of God to listen to everything the Lord has commanded you to tell us.” Then Peter began to speak: “I now realize how true it is that God does not show favoritism but accepts from every nation the one who fears him and does what is right. You know the message God sent to the people of Israel, announcing the good news of peace through Jesus Christ, who is Lord of all. You know what has happened throughout the province of Judea, beginning in Galilee after the baptism that John preached— how God anointed Jesus of Nazareth with the Holy Spirit and power, and how he went around doing good and healing all who were under the power of the devil, because God was with him. “We are witnesses of everything he did in the country of the Jews and in Jerusalem. They killed him by hanging him on a cross, but God raised him from the dead on the third day and caused him to be seen. He was not seen by all the people, but by witnesses whom God had already chosen—by us who ate and drank with him after he rose from the dead. He commanded us to preach to the people and to testify that he is the one whom God appointed as judge of the living and the dead. All the prophets testify about him that everyone who believes in him receives forgiveness of sins through his name.” While Peter was still speaking these words, the Holy Spirit came on all who heard the message. The circumcised believers who had come with Peter were astonished that the gift of the Holy Spirit had been poured out even on Gentiles. For they heard them speaking in tongues and praising God.\nThen Peter said, “Surely no one can stand in the way of their being baptized with water. They have received the Holy Spirit just as we have.” So he ordered that they be baptized in the name of Jesus Christ. Then they asked Peter to stay with them for a few days. \n\nThe apostles and the believers throughout Judea heard that the Gentiles also had received the word of God. So when Peter went up to Jerusalem, the circumcised believers criticized him and said, “You went into the house of uncircumcised men and ate with them.” Starting from the beginning, Peter told them the whole story: “I was in the city of Joppa praying, and in a trance I saw a vision. I saw something like a large sheet being let down from heaven by its four corners, and it came down to where I was. I looked into it and saw four-footed animals of the earth, wild beasts, reptiles and birds. Then I heard a voice telling me, ‘Get up, Peter. Kill and eat.’ “I replied, ‘Surely not, Lord! Nothing impure or unclean has ever entered my mouth.’ “The voice spoke from heaven a second time, ‘Do not call anything impure that God has made clean.’ This happened three times, and then it was all pulled up to heaven again. “Right then three men who had been sent to me from Caesarea stopped at the house where I was staying. The Spirit told me to have no hesitation about going with them. These six brothers also went with me, and we entered the man’s house. He told us how he had seen an angel appear in his house and say, ‘Send to Joppa for Simon who is called Peter. He will bring you a message through which you and all your household will be saved.’ “As I began to speak, the Holy Spirit came on them as he had come on us at the beginning. Then I remembered what the Lord had said: ‘John baptized with water, but you will be baptized with the Holy Spirit.’ So if God gave them the same gift he gave us who believed in the Lord Jesus Christ, who was I to think that I could stand in God’s way?” When they heard this, they had no further objections and praised God, saying, “So then, even to Gentiles God has granted repentance that leads to life.” Now those who had been scattered by the persecution that broke out when Stephen was killed traveled as far as Phoenicia, Cyprus and Antioch, spreading the word only among Jews. Some of them, however, men from Cyprus and Cyrene, went to Antioch and began to speak to Greeks also, telling them the good news about the Lord Jesus. The Lord’s hand was with them, and a great number of people believed and turned to the Lord. News of this reached the church in Jerusalem, and they sent Barnabas to Antioch. When he arrived and saw what the grace of God had done, he was glad and encouraged them all to remain true to the Lord with all their hearts. He was a good man, full of the Holy Spirit and faith, and a great number of people were brought to the Lord. Then Barnabas went to Tarsus to look for Saul, and when he found him, he brought him to Antioch. So for a whole year Barnabas and Saul met with the church and taught great numbers of people. The disciples were called Christians first at Antioch. During this time some prophets came down from Jerusalem to Antioch. One of them, named Agabus, stood up and through the Spirit predicted that a severe famine would spread over the entire Roman world. (This happened during the reign of Claudius.) The disciples, as each one was able, decided to provide help for the brothers and sisters living in Judea. This they did, sending their gift to the elders by Barnabas and Saul. \n\nIt was about this time that King Herod arrested some who belonged to the church, intending to persecute them. He had James, the brother of John, put to death with the sword. When he saw that this met with approval among the Jews, he proceeded to seize Peter also. This happened during the Festival of Unleavened Bread. After arresting him, he put him in prison, handing him over to be guarded by four squads of four soldiers each. Herod intended to bring him out for public trial after the Passover. So Peter was kept in prison, but the church was earnestly praying to God for him. The night before Herod was to bring him to trial, Peter was sleeping between two soldiers, bound with two chains, and sentries stood guard at the entrance. Suddenly an angel of the Lord appeared and a light shone in the cell. He struck Peter on the side and woke him up. “Quick, get up!” he said, and the chains fell off Peter’s wrists. Then the angel said to him, “Put on your clothes and sandals.” And Peter did so. “Wrap your cloak around you and follow me,” the angel told him. Peter followed him out of the prison, but he had no idea that what the angel was doing was really happening; he thought he was seeing a vision. They passed the first and second guards and came to the iron gate leading to the city. It opened for them by itself, and they went through it. When they had walked the length of one street, suddenly the angel left him. Then Peter came to himself and said, “Now I know without a doubt that the Lord has sent his angel and rescued me from Herod’s clutches and from everything the Jewish people were hoping would happen.” When this had dawned on him, he went to the house of Mary the mother of John, also called Mark, where many people had gathered and were praying. Peter knocked at the outer entrance, and a servant named Rhoda came to answer the door. When she recognized Peter’s voice, she was so overjoyed she ran back without opening it and exclaimed, “Peter is at the door!” “You’re out of your mind,” they told her. When she kept insisting that it was so, they said, “It must be his angel.” But Peter kept on knocking, and when they opened the door and saw him, they were astonished. Peter motioned with his hand for them to be quiet and described how the Lord had brought him out of prison. “Tell James and the other brothers and sisters about this,” he said, and then he left for another place. In the morning, there was no small commotion among the soldiers as to what had become of Peter. After Herod had a thorough search made for him and did not find him, he cross-examined the guards and ordered that they be executed.\nThen Herod went from Judea to Caesarea and stayed there. He had been quarreling with the people of Tyre and Sidon; they now joined together and sought an audience with him. After securing the support of Blastus, a trusted personal servant of the king, they asked for peace, because they depended on the king’s country for their food supply. On the appointed day Herod, wearing his royal robes, sat on his throne and delivered a public address to the people. They shouted, “This is the voice of a god, not of a man.” Immediately, because Herod did not give praise to God, an angel of the Lord struck him down, and he was eaten by worms and died. But the word of God continued to spread and flourish. When Barnabas and Saul had finished their mission, they returned from Jerusalem, taking with them John, also called Mark. \n\nNow in the church at Antioch there were prophets and teachers: Barnabas, Simeon called Niger, Lucius of Cyrene, Manaen (who had been brought up with Herod the tetrarch) and Saul. While they were worshiping the Lord and fasting, the Holy Spirit said, “Set apart for me Barnabas and Saul for the work to which I have called them.” So after they had fasted and prayed, they placed their hands on them and sent them off. The two of them, sent on their way by the Holy Spirit, went down to Seleucia and sailed from there to Cyprus. When they arrived at Salamis, they proclaimed the word of God in the Jewish synagogues. John was with them as their helper. They traveled through the whole island until they came to Paphos. There they met a Jewish sorcerer and false prophet named Bar-Jesus, who was an attendant of the proconsul, Sergius Paulus. The proconsul, an intelligent man, sent for Barnabas and Saul because he wanted to hear the word of God. But Elymas the sorcerer (for that is what his name means) opposed them and tried to turn the proconsul from the faith. Then Saul, who was also called Paul, filled with the Holy Spirit, looked straight at Elymas and said, “You are a child of the devil and an enemy of everything that is right! You are full of all kinds of deceit and trickery. Will you never stop perverting the right ways of the Lord? Now the hand of the Lord is against you. You are going to be blind for a time, not even able to see the light of the sun.”\nImmediately mist and darkness came over him, and he groped about, seeking someone to lead him by the hand. When the proconsul saw what had happened, he believed, for he was amazed at the teaching about the Lord. From Paphos, Paul and his companions sailed to Perga in Pamphylia, where John left them to return to Jerusalem. From Perga they went on to Pisidian Antioch. On the Sabbath they entered the synagogue and sat down. After the reading from the Law and the Prophets, the leaders of the synagogue sent word to them, saying, “Brothers, if you have a word of exhortation for the people, please speak.” Standing up, Paul motioned with his hand and said: “Fellow Israelites and you Gentiles who worship God, listen to me! The God of the people of Israel chose our ancestors; he made the people prosper during their stay in Egypt; with mighty power he led them out of that country; for about forty years he endured their conduct in the wilderness; and he overthrew seven nations in Canaan, giving their land to his people as their inheritance. All this took about 450 years.\n“After this, God gave them judges until the time of Samuel the prophet. Then the people asked for a king, and he gave them Saul son of Kish, of the tribe of Benjamin, who ruled forty years. After removing Saul, he made David their king. God testified concerning him: ‘I have found David son of Jesse, a man after my own heart; he will do everything I want him to do.’ “From this man’s descendants God has brought to Israel the Savior Jesus, as he promised. Before the coming of Jesus, John preached repentance and baptism to all the people of Israel. As John was completing his work, he said: ‘Who do you suppose I am? I am not the one you are looking for. But there is one coming after me whose sandals I am not worthy to untie.’ “Fellow children of Abraham and you God-fearing Gentiles, it is to us that this message of salvation has been sent. The people of Jerusalem and their rulers did not recognize Jesus, yet in condemning him they fulfilled the words of the prophets that are read every Sabbath. Though they found no proper ground for a death sentence, they asked Pilate to have him executed. When they had carried out all that was written about him, they took him down from the cross and laid him in a tomb. But God raised him from the dead, and for many days he was seen by those who had traveled with him from Galilee to Jerusalem. They are now his witnesses to our people. “We tell you the good news: What God promised our ancestors he has fulfilled for us, their children, by raising up Jesus. As it is written in the second Psalm:\n“‘You are my son;\n    today I have become your father.’ God raised him from the dead so that he will never be subject to decay. As God has said,\n“‘I will give you the holy and sure blessings promised to David.’ So it is also stated elsewhere:\n“‘You will not let your holy one see decay.’ “Now when David had served God’s purpose in his own generation, he fell asleep; he was buried with his ancestors and his body decayed. But the one whom God raised from the dead did not see decay. “Therefore, my friends, I want you to know that through Jesus the forgiveness of sins is proclaimed to you. Through him everyone who believes is set free from every sin, a justification you were not able to obtain under the law of Moses. Take care that what the prophets have said does not happen to you: “‘Look, you scoffers,\n    wonder and perish,\nfor I am going to do something in your days\n    that you would never believe,\n    even if someone told you.’” As Paul and Barnabas were leaving the synagogue, the people invited them to speak further about these things on the next Sabbath. When the congregation was dismissed, many of the Jews and devout converts to Judaism followed Paul and Barnabas, who talked with them and urged them to continue in the grace of God. On the next Sabbath almost the whole city gathered to hear the word of the Lord. When the Jews saw the crowds, they were filled with jealousy. They began to contradict what Paul was saying and heaped abuse on him. Then Paul and Barnabas answered them boldly: “We had to speak the word of God to you first. Since you reject it and do not consider yourselves worthy of eternal life, we now turn to the Gentiles. For this is what the Lord has commanded us:\n“‘I have made you a light for the Gentiles,\n    that you may bring salvation to the ends of the earth.’” When the Gentiles heard this, they were glad and honored the word of the Lord; and all who were appointed for eternal life believed. The word of the Lord spread through the whole region. But the Jewish leaders incited the God-fearing women of high standing and the leading men of the city. They stirred up persecution against Paul and Barnabas, and expelled them from their region. So they shook the dust off their feet as a warning to them and went to Iconium. And the disciples were filled with joy and with the Holy Spirit. \n\nAt Iconium Paul and Barnabas went as usual into the Jewish synagogue. There they spoke so effectively that a great number of Jews and Greeks believed. But the Jews who refused to believe stirred up the other Gentiles and poisoned their minds against the brothers. So Paul and Barnabas spent considerable time there, speaking boldly for the Lord, who confirmed the message of his grace by enabling them to perform signs and wonders. The people of the city were divided; some sided with the Jews, others with the apostles. There was a plot afoot among both Gentiles and Jews, together with their leaders, to mistreat them and stone them. But they found out about it and fled to the Lycaonian cities of Lystra and Derbe and to the surrounding country, where they continued to preach the gospel. In Lystra there sat a man who was lame. He had been that way from birth and had never walked. He listened to Paul as he was speaking. Paul looked directly at him, saw that he had faith to be healed and called out, “Stand up on your feet!” At that, the man jumped up and began to walk. When the crowd saw what Paul had done, they shouted in the Lycaonian language, “The gods have come down to us in human form!” Barnabas they called Zeus, and Paul they called Hermes because he was the chief speaker. The priest of Zeus, whose temple was just outside the city, brought bulls and wreaths to the city gates because he and the crowd wanted to offer sacrifices to them. But when the apostles Barnabas and Paul heard of this, they tore their clothes and rushed out into the crowd, shouting: “Friends, why are you doing this? We too are only human, like you. We are bringing you good news, telling you to turn from these worthless things to the living God, who made the heavens and the earth and the sea and everything in them. In the past, he let all nations go their own way. Yet he has not left himself without testimony: He has shown kindness by giving you rain from heaven and crops in their seasons; he provides you with plenty of food and fills your hearts with joy.” Even with these words, they had difficulty keeping the crowd from sacrificing to them. Then some Jews came from Antioch and Iconium and won the crowd over. They stoned Paul and dragged him outside the city, thinking he was dead. But after the disciples had gathered around him, he got up and went back into the city. The next day he and Barnabas left for Derbe. They preached the gospel in that city and won a large number of disciples. Then they returned to Lystra, Iconium and Antioch, strengthening the disciples and encouraging them to remain true to the faith. “We must go through many hardships to enter the kingdom of God,” they said. Paul and Barnabas appointed elders for them in each church and, with prayer and fasting, committed them to the Lord, in whom they had put their trust. After going through Pisidia, they came into Pamphylia, and when they had preached the word in Perga, they went down to Attalia. From Attalia they sailed back to Antioch, where they had been committed to the grace of God for the work they had now completed. On arriving there, they gathered the church together and reported all that God had done through them and how he had opened a door of faith to the Gentiles. And they stayed there a long time with the disciples. \n\nCertain people came down from Judea to Antioch and were teaching the believers: “Unless you are circumcised, according to the custom taught by Moses, you cannot be saved.” This brought Paul and Barnabas into sharp dispute and debate with them. So Paul and Barnabas were appointed, along with some other believers, to go up to Jerusalem to see the apostles and elders about this question. The church sent them on their way, and as they traveled through Phoenicia and Samaria, they told how the Gentiles had been converted. This news made all the believers very glad. When they came to Jerusalem, they were welcomed by the church and the apostles and elders, to whom they reported everything God had done through them. Then some of the believers who belonged to the party of the Pharisees stood up and said, “The Gentiles must be circumcised and required to keep the law of Moses.” The apostles and elders met to consider this question. After much discussion, Peter got up and addressed them: “Brothers, you know that some time ago God made a choice among you that the Gentiles might hear from my lips the message of the gospel and believe. God, who knows the heart, showed that he accepted them by giving the Holy Spirit to them, just as he did to us. He did not discriminate between us and them, for he purified their hearts by faith. Now then, why do you try to test God by putting on the necks of Gentiles a yoke that neither we nor our ancestors have been able to bear? No! We believe it is through the grace of our Lord Jesus that we are saved, just as they are.” The whole assembly became silent as they listened to Barnabas and Paul telling about the signs and wonders God had done among the Gentiles through them. When they finished, James spoke up. “Brothers,” he said, “listen to me. Simon has described to us how God first intervened to choose a people for his name from the Gentiles. The words of the prophets are in agreement with this, as it is written: “‘After this I will return\n    and rebuild David’s fallen tent.\nIts ruins I will rebuild,\n    and I will restore it, that the rest of mankind may seek the Lord,\n    even all the Gentiles who bear my name,\nsays the Lord, who does these things’— things known from long ago. “It is my judgment, therefore, that we should not make it difficult for the Gentiles who are turning to God. Instead we should write to them, telling them to abstain from food polluted by idols, from sexual immorality, from the meat of strangled animals and from blood. For the law of Moses has been preached in every city from the earliest times and is read in the synagogues on every Sabbath.” Then the apostles and elders, with the whole church, decided to choose some of their own men and send them to Antioch with Paul and Barnabas. They chose Judas (called Barsabbas) and Silas, men who were leaders among the believers. With them they sent the following letter:\nThe apostles and elders, your brothers,\nTo the Gentile believers in Antioch, Syria and Cilicia:\nGreetings. We have heard that some went out from us without our authorization and disturbed you, troubling your minds by what they said. So we all agreed to choose some men and send them to you with our dear friends Barnabas and Paul— men who have risked their lives for the name of our Lord Jesus Christ. Therefore we are sending Judas and Silas to confirm by word of mouth what we are writing. It seemed good to the Holy Spirit and to us not to burden you with anything beyond the following requirements: You are to abstain from food sacrificed to idols, from blood, from the meat of strangled animals and from sexual immorality. You will do well to avoid these things.\nFarewell. So the men were sent off and went down to Antioch, where they gathered the church together and delivered the letter. The people read it and were glad for its encouraging message. Judas and Silas, who themselves were prophets, said much to encourage and strengthen the believers. After spending some time there, they were sent off by the believers with the blessing of peace to return to those who had sent them.  But Paul and Barnabas remained in Antioch, where they and many others taught and preached the word of the Lord. Some time later Paul said to Barnabas, “Let us go back and visit the believers in all the towns where we preached the word of the Lord and see how they are doing.” Barnabas wanted to take John, also called Mark, with them, but Paul did not think it wise to take him, because he had deserted them in Pamphylia and had not continued with them in the work. They had such a sharp disagreement that they parted company. Barnabas took Mark and sailed for Cyprus, but Paul chose Silas and left, commended by the believers to the grace of the Lord. He went through Syria and Cilicia, strengthening the churches. \n\nPaul came to Derbe and then to Lystra, where a disciple named Timothy lived, whose mother was Jewish and a believer but whose father was a Greek. The believers at Lystra and Iconium spoke well of him. Paul wanted to take him along on the journey, so he circumcised him because of the Jews who lived in that area, for they all knew that his father was a Greek. As they traveled from town to town, they delivered the decisions reached by the apostles and elders in Jerusalem for the people to obey. So the churches were strengthened in the faith and grew daily in numbers. Paul and his companions traveled throughout the region of Phrygia and Galatia, having been kept by the Holy Spirit from preaching the word in the province of Asia. When they came to the border of Mysia, they tried to enter Bithynia, but the Spirit of Jesus would not allow them to. So they passed by Mysia and went down to Troas. During the night Paul had a vision of a man of Macedonia standing and begging him, “Come over to Macedonia and help us.” After Paul had seen the vision, we got ready at once to leave for Macedonia, concluding that God had called us to preach the gospel to them. From Troas we put out to sea and sailed straight for Samothrace, and the next day we went on to Neapolis. From there we traveled to Philippi, a Roman colony and the leading city of that district of Macedonia. And we stayed there several days. On the Sabbath we went outside the city gate to the river, where we expected to find a place of prayer. We sat down and began to speak to the women who had gathered there. One of those listening was a woman from the city of Thyatira named Lydia, a dealer in purple cloth. She was a worshiper of God. The Lord opened her heart to respond to Paul’s message. When she and the members of her household were baptized, she invited us to her home. “If you consider me a believer in the Lord,” she said, “come and stay at my house.” And she persuaded us. Once when we were going to the place of prayer, we were met by a female slave who had a spirit by which she predicted the future. She earned a great deal of money for her owners by fortune-telling. She followed Paul and the rest of us, shouting, “These men are servants of the Most High God, who are telling you the way to be saved.” She kept this up for many days. Finally Paul became so annoyed that he turned around and said to the spirit, “In the name of Jesus Christ I command you to come out of her!” At that moment the spirit left her. When her owners realized that their hope of making money was gone, they seized Paul and Silas and dragged them into the marketplace to face the authorities. They brought them before the magistrates and said, “These men are Jews, and are throwing our city into an uproar by advocating customs unlawful for us Romans to accept or practice.” The crowd joined in the attack against Paul and Silas, and the magistrates ordered them to be stripped and beaten with rods. After they had been severely flogged, they were thrown into prison, and the jailer was commanded to guard them carefully. When he received these orders, he put them in the inner cell and fastened their feet in the stocks. About midnight Paul and Silas were praying and singing hymns to God, and the other prisoners were listening to them. Suddenly there was such a violent earthquake that the foundations of the prison were shaken. At once all the prison doors flew open, and everyone’s chains came loose. The jailer woke up, and when he saw the prison doors open, he drew his sword and was about to kill himself because he thought the prisoners had escaped. But Paul shouted, “Don’t harm yourself! We are all here!” The jailer called for lights, rushed in and fell trembling before Paul and Silas. He then brought them out and asked, “Sirs, what must I do to be saved?” They replied, “Believe in the Lord Jesus, and you will be saved—you and your household.” Then they spoke the word of the Lord to him and to all the others in his house. At that hour of the night the jailer took them and washed their wounds; then immediately he and all his household were baptized. The jailer brought them into his house and set a meal before them; he was filled with joy because he had come to believe in God—he and his whole household. When it was daylight, the magistrates sent their officers to the jailer with the order: “Release those men.” The jailer told Paul, “The magistrates have ordered that you and Silas be released. Now you can leave. Go in peace.” But Paul said to the officers: “They beat us publicly without a trial, even though we are Roman citizens, and threw us into prison. And now do they want to get rid of us quietly? No! Let them come themselves and escort us out.” The officers reported this to the magistrates, and when they heard that Paul and Silas were Roman citizens, they were alarmed. They came to appease them and escorted them from the prison, requesting them to leave the city. After Paul and Silas came out of the prison, they went to Lydia’s house, where they met with the brothers and sisters and encouraged them. Then they left. \n\nWhen Paul and his companions had passed through Amphipolis and Apollonia, they came to Thessalonica, where there was a Jewish synagogue. As was his custom, Paul went into the synagogue, and on three Sabbath days he reasoned with them from the Scriptures, explaining and proving that the Messiah had to suffer and rise from the dead. “This Jesus I am proclaiming to you is the Messiah,” he said. Some of the Jews were persuaded and joined Paul and Silas, as did a large number of God-fearing Greeks and quite a few prominent women. But other Jews were jealous; so they rounded up some bad characters from the marketplace, formed a mob and started a riot in the city. They rushed to Jason’s house in search of Paul and Silas in order to bring them out to the crowd. But when they did not find them, they dragged Jason and some other believers before the city officials, shouting: “These men who have caused trouble all over the world have now come here, and Jason has welcomed them into his house. They are all defying Caesar’s decrees, saying that there is another king, one called Jesus.” When they heard this, the crowd and the city officials were thrown into turmoil. Then they made Jason and the others post bond and let them go. As soon as it was night, the believers sent Paul and Silas away to Berea. On arriving there, they went to the Jewish synagogue. Now the Berean Jews were of more noble character than those in Thessalonica, for they received the message with great eagerness and examined the Scriptures every day to see if what Paul said was true. As a result, many of them believed, as did also a number of prominent Greek women and many Greek men. But when the Jews in Thessalonica learned that Paul was preaching the word of God at Berea, some of them went there too, agitating the crowds and stirring them up. The believers immediately sent Paul to the coast, but Silas and Timothy stayed at Berea. Those who escorted Paul brought him to Athens and then left with instructions for Silas and Timothy to join him as soon as possible. While Paul was waiting for them in Athens, he was greatly distressed to see that the city was full of idols. So he reasoned in the synagogue with both Jews and God-fearing Greeks, as well as in the marketplace day by day with those who happened to be there. A group of Epicurean and Stoic philosophers began to debate with him. Some of them asked, “What is this babbler trying to say?” Others remarked, “He seems to be advocating foreign gods.” They said this because Paul was preaching the good news about Jesus and the resurrection. Then they took him and brought him to a meeting of the Areopagus, where they said to him, “May we know what this new teaching is that you are presenting? You are bringing some strange ideas to our ears, and we would like to know what they mean.” (All the Athenians and the foreigners who lived there spent their time doing nothing but talking about and listening to the latest ideas.) Paul then stood up in the meeting of the Areopagus and said: “People of Athens! I see that in every way you are very religious. For as I walked around and looked carefully at your objects of worship, I even found an altar with this inscription: to an unknown god. So you are ignorant of the very thing you worship—and this is what I am going to proclaim to you. “The God who made the world and everything in it is the Lord of heaven and earth and does not live in temples built by human hands. And he is not served by human hands, as if he needed anything. Rather, he himself gives everyone life and breath and everything else. From one man he made all the nations, that they should inhabit the whole earth; and he marked out their appointed times in history and the boundaries of their lands. God did this so that they would seek him and perhaps reach out for him and find him, though he is not far from any one of us. ‘For in him we live and move and have our being.’ As some of your own poets have said, ‘We are his offspring.’ “Therefore since we are God’s offspring, we should not think that the divine being is like gold or silver or stone—an image made by human design and skill. In the past God overlooked such ignorance, but now he commands all people everywhere to repent. For he has set a day when he will judge the world with justice by the man he has appointed. He has given proof of this to everyone by raising him from the dead.” When they heard about the resurrection of the dead, some of them sneered, but others said, “We want to hear you again on this subject.” At that, Paul left the Council. Some of the people became followers of Paul and believed. Among them was Dionysius, a member of the Areopagus, also a woman named Damaris, and a number of others. \n\nAfter this, Paul left Athens and went to Corinth. There he met a Jew named Aquila, a native of Pontus, who had recently come from Italy with his wife Priscilla, because Claudius had ordered all Jews to leave Rome. Paul went to see them, and because he was a tentmaker as they were, he stayed and worked with them. Every Sabbath he reasoned in the synagogue, trying to persuade Jews and Greeks. When Silas and Timothy came from Macedonia, Paul devoted himself exclusively to preaching, testifying to the Jews that Jesus was the Messiah. But when they opposed Paul and became abusive, he shook out his clothes in protest and said to them, “Your blood be on your own heads! I am innocent of it. From now on I will go to the Gentiles.” Then Paul left the synagogue and went next door to the house of Titius Justus, a worshiper of God. Crispus, the synagogue leader, and his entire household believed in the Lord; and many of the Corinthians who heard Paul believed and were baptized. One night the Lord spoke to Paul in a vision: “Do not be afraid; keep on speaking, do not be silent. For I am with you, and no one is going to attack and harm you, because I have many people in this city.” So Paul stayed in Corinth for a year and a half, teaching them the word of God. While Gallio was proconsul of Achaia, the Jews of Corinth made a united attack on Paul and brought him to the place of judgment. “This man,” they charged, “is persuading the people to worship God in ways contrary to the law.” Just as Paul was about to speak, Gallio said to them, “If you Jews were making a complaint about some misdemeanor or serious crime, it would be reasonable for me to listen to you. But since it involves questions about words and names and your own law—settle the matter yourselves. I will not be a judge of such things.” So he drove them off. Then the crowd there turned on Sosthenes the synagogue leader and beat him in front of the proconsul; and Gallio showed no concern whatever. Paul stayed on in Corinth for some time. Then he left the brothers and sisters and sailed for Syria, accompanied by Priscilla and Aquila. Before he sailed, he had his hair cut off at Cenchreae because of a vow he had taken. They arrived at Ephesus, where Paul left Priscilla and Aquila. He himself went into the synagogue and reasoned with the Jews. When they asked him to spend more time with them, he declined. But as he left, he promised, “I will come back if it is God’s will.” Then he set sail from Ephesus. When he landed at Caesarea, he went up to Jerusalem and greeted the church and then went down to Antioch. After spending some time in Antioch, Paul set out from there and traveled from place to place throughout the region of Galatia and Phrygia, strengthening all the disciples. Meanwhile a Jew named Apollos, a native of Alexandria, came to Ephesus. He was a learned man, with a thorough knowledge of the Scriptures. He had been instructed in the way of the Lord, and he spoke with great fervor and taught about Jesus accurately, though he knew only the baptism of John. He began to speak boldly in the synagogue. When Priscilla and Aquila heard him, they invited him to their home and explained to him the way of God more adequately. When Apollos wanted to go to Achaia, the brothers and sisters encouraged him and wrote to the disciples there to welcome him. When he arrived, he was a great help to those who by grace had believed. For he vigorously refuted his Jewish opponents in public debate, proving from the Scriptures that Jesus was the Messiah. \n\nWhile Apollos was at Corinth, Paul took the road through the interior and arrived at Ephesus. There he found some disciples and asked them, “Did you receive the Holy Spirit when you believed?”\nThey answered, “No, we have not even heard that there is a Holy Spirit.” So Paul asked, “Then what baptism did you receive?”\n“John’s baptism,” they replied. Paul said, “John’s baptism was a baptism of repentance. He told the people to believe in the one coming after him, that is, in Jesus.” On hearing this, they were baptized in the name of the Lord Jesus. When Paul placed his hands on them, the Holy Spirit came on them, and they spoke in tongues and prophesied. There were about twelve men in all. Paul entered the synagogue and spoke boldly there for three months, arguing persuasively about the kingdom of God. But some of them became obstinate; they refused to believe and publicly maligned the Way. So Paul left them. He took the disciples with him and had discussions daily in the lecture hall of Tyrannus. This went on for two years, so that all the Jews and Greeks who lived in the province of Asia heard the word of the Lord. God did extraordinary miracles through Paul, so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them. Some Jews who went around driving out evil spirits tried to invoke the name of the Lord Jesus over those who were demon-possessed. They would say, “In the name of the Jesus whom Paul preaches, I command you to come out.” Seven sons of Sceva, a Jewish chief priest, were doing this. One day the evil spirit answered them, “Jesus I know, and Paul I know about, but who are you?” Then the man who had the evil spirit jumped on them and overpowered them all. He gave them such a beating that they ran out of the house naked and bleeding. When this became known to the Jews and Greeks living in Ephesus, they were all seized with fear, and the name of the Lord Jesus was held in high honor. Many of those who believed now came and openly confessed what they had done. A number who had practiced sorcery brought their scrolls together and burned them publicly. When they calculated the value of the scrolls, the total came to fifty thousand drachmas. In this way the word of the Lord spread widely and grew in power. After all this had happened, Paul decided to go to Jerusalem, passing through Macedonia and Achaia. “After I have been there,” he said, “I must visit Rome also.” He sent two of his helpers, Timothy and Erastus, to Macedonia, while he stayed in the province of Asia a little longer. About that time there arose a great disturbance about the Way. A silversmith named Demetrius, who made silver shrines of Artemis, brought in a lot of business for the craftsmen there. He called them together, along with the workers in related trades, and said: “You know, my friends, that we receive a good income from this business. And you see and hear how this fellow Paul has convinced and led astray large numbers of people here in Ephesus and in practically the whole province of Asia. He says that gods made by human hands are no gods at all. There is danger not only that our trade will lose its good name, but also that the temple of the great goddess Artemis will be discredited; and the goddess herself, who is worshiped throughout the province of Asia and the world, will be robbed of her divine majesty.” When they heard this, they were furious and began shouting: “Great is Artemis of the Ephesians!” Soon the whole city was in an uproar. The people seized Gaius and Aristarchus, Paul’s traveling companions from Macedonia, and all of them rushed into the theater together. Paul wanted to appear before the crowd, but the disciples would not let him. Even some of the officials of the province, friends of Paul, sent him a message begging him not to venture into the theater. The assembly was in confusion: Some were shouting one thing, some another. Most of the people did not even know why they were there. The Jews in the crowd pushed Alexander to the front, and they shouted instructions to him. He motioned for silence in order to make a defense before the people. But when they realized he was a Jew, they all shouted in unison for about two hours: “Great is Artemis of the Ephesians!” The city clerk quieted the crowd and said: “Fellow Ephesians, doesn’t all the world know that the city of Ephesus is the guardian of the temple of the great Artemis and of her image, which fell from heaven? Therefore, since these facts are undeniable, you ought to calm down and not do anything rash. You have brought these men here, though they have neither robbed temples nor blasphemed our goddess. If, then, Demetrius and his fellow craftsmen have a grievance against anybody, the courts are open and there are proconsuls. They can press charges. If there is anything further you want to bring up, it must be settled in a legal assembly. As it is, we are in danger of being charged with rioting because of what happened today. In that case we would not be able to account for this commotion, since there is no reason for it.” After he had said this, he dismissed the assembly. \n\nWhen the uproar had ended, Paul sent for the disciples and, after encouraging them, said goodbye and set out for Macedonia. He traveled through that area, speaking many words of encouragement to the people, and finally arrived in Greece, where he stayed three months. Because some Jews had plotted against him just as he was about to sail for Syria, he decided to go back through Macedonia. He was accompanied by Sopater son of Pyrrhus from Berea, Aristarchus and Secundus from Thessalonica, Gaius from Derbe, Timothy also, and Tychicus and Trophimus from the province of Asia. These men went on ahead and waited for us at Troas. But we sailed from Philippi after the Festival of Unleavened Bread, and five days later joined the others at Troas, where we stayed seven days. On the first day of the week we came together to break bread. Paul spoke to the people and, because he intended to leave the next day, kept on talking until midnight. There were many lamps in the upstairs room where we were meeting. Seated in a window was a young man named Eutychus, who was sinking into a deep sleep as Paul talked on and on. When he was sound asleep, he fell to the ground from the third story and was picked up dead. Paul went down, threw himself on the young man and put his arms around him. “Don’t be alarmed,” he said. “He’s alive!” Then he went upstairs again and broke bread and ate. After talking until daylight, he left. The people took the young man home alive and were greatly comforted. We went on ahead to the ship and sailed for Assos, where we were going to take Paul aboard. He had made this arrangement because he was going there on foot. When he met us at Assos, we took him aboard and went on to Mitylene. The next day we set sail from there and arrived off Chios. The day after that we crossed over to Samos, and on the following day arrived at Miletus. Paul had decided to sail past Ephesus to avoid spending time in the province of Asia, for he was in a hurry to reach Jerusalem, if possible, by the day of Pentecost. From Miletus, Paul sent to Ephesus for the elders of the church. When they arrived, he said to them: “You know how I lived the whole time I was with you, from the first day I came into the province of Asia. I served the Lord with great humility and with tears and in the midst of severe testing by the plots of my Jewish opponents. You know that I have not hesitated to preach anything that would be helpful to you but have taught you publicly and from house to house. I have declared to both Jews and Greeks that they must turn to God in repentance and have faith in our Lord Jesus. “And now, compelled by the Spirit, I am going to Jerusalem, not knowing what will happen to me there. I only know that in every city the Holy Spirit warns me that prison and hardships are facing me. However, I consider my life worth nothing to me; my only aim is to finish the race and complete the task the Lord Jesus has given me—the task of testifying to the good news of God’s grace. “Now I know that none of you among whom I have gone about preaching the kingdom will ever see me again. Therefore, I declare to you today that I am innocent of the blood of any of you. For I have not hesitated to proclaim to you the whole will of God. Keep watch over yourselves and all the flock of which the Holy Spirit has made you overseers. Be shepherds of the church of God, which he bought with his own blood. I know that after I leave, savage wolves will come in among you and will not spare the flock. Even from your own number men will arise and distort the truth in order to draw away disciples after them. So be on your guard! Remember that for three years I never stopped warning each of you night and day with tears. “Now I commit you to God and to the word of his grace, which can build you up and give you an inheritance among all those who are sanctified. I have not coveted anyone’s silver or gold or clothing. You yourselves know that these hands of mine have supplied my own needs and the needs of my companions. In everything I did, I showed you that by this kind of hard work we must help the weak, remembering the words the Lord Jesus himself said: ‘It is more blessed to give than to receive.’ ” When Paul had finished speaking, he knelt down with all of them and prayed. They all wept as they embraced him and kissed him. What grieved them most was his statement that they would never see his face again. Then they accompanied him to the ship. \n\nAfter we had torn ourselves away from them, we put out to sea and sailed straight to Kos. The next day we went to Rhodes and from there to Patara. We found a ship crossing over to Phoenicia, went on board and set sail. After sighting Cyprus and passing to the south of it, we sailed on to Syria. We landed at Tyre, where our ship was to unload its cargo. We sought out the disciples there and stayed with them seven days. Through the Spirit they urged Paul not to go on to Jerusalem. When it was time to leave, we left and continued on our way. All of them, including wives and children, accompanied us out of the city, and there on the beach we knelt to pray. After saying goodbye to each other, we went aboard the ship, and they returned home. We continued our voyage from Tyre and landed at Ptolemais, where we greeted the brothers and sisters and stayed with them for a day. Leaving the next day, we reached Caesarea and stayed at the house of Philip the evangelist, one of the Seven. He had four unmarried daughters who prophesied. After we had been there a number of days, a prophet named Agabus came down from Judea. Coming over to us, he took Paul’s belt, tied his own hands and feet with it and said, “The Holy Spirit says, ‘In this way the Jewish leaders in Jerusalem will bind the owner of this belt and will hand him over to the Gentiles.’” When we heard this, we and the people there pleaded with Paul not to go up to Jerusalem. Then Paul answered, “Why are you weeping and breaking my heart? I am ready not only to be bound, but also to die in Jerusalem for the name of the Lord Jesus.” When he would not be dissuaded, we gave up and said, “The Lord’s will be done.” After this, we started on our way up to Jerusalem. Some of the disciples from Caesarea accompanied us and brought us to the home of Mnason, where we were to stay. He was a man from Cyprus and one of the early disciples. When we arrived at Jerusalem, the brothers and sisters received us warmly. The next day Paul and the rest of us went to see James, and all the elders were present. Paul greeted them and reported in detail what God had done among the Gentiles through his ministry. When they heard this, they praised God. Then they said to Paul: “You see, brother, how many thousands of Jews have believed, and all of them are zealous for the law. They have been informed that you teach all the Jews who live among the Gentiles to turn away from Moses, telling them not to circumcise their children or live according to our customs. What shall we do? They will certainly hear that you have come, so do what we tell you. There are four men with us who have made a vow. Take these men, join in their purification rites and pay their expenses, so that they can have their heads shaved. Then everyone will know there is no truth in these reports about you, but that you yourself are living in obedience to the law. As for the Gentile believers, we have written to them our decision that they should abstain from food sacrificed to idols, from blood, from the meat of strangled animals and from sexual immorality.” The next day Paul took the men and purified himself along with them. Then he went to the temple to give notice of the date when the days of purification would end and the offering would be made for each of them. When the seven days were nearly over, some Jews from the province of Asia saw Paul at the temple. They stirred up the whole crowd and seized him, shouting, “Fellow Israelites, help us! This is the man who teaches everyone everywhere against our people and our law and this place. And besides, he has brought Greeks into the temple and defiled this holy place.” (They had previously seen Trophimus the Ephesian in the city with Paul and assumed that Paul had brought him into the temple.) The whole city was aroused, and the people came running from all directions. Seizing Paul, they dragged him from the temple, and immediately the gates were shut. While they were trying to kill him, news reached the commander of the Roman troops that the whole city of Jerusalem was in an uproar. He at once took some officers and soldiers and ran down to the crowd. When the rioters saw the commander and his soldiers, they stopped beating Paul. The commander came up and arrested him and ordered him to be bound with two chains. Then he asked who he was and what he had done. Some in the crowd shouted one thing and some another, and since the commander could not get at the truth because of the uproar, he ordered that Paul be taken into the barracks. When Paul reached the steps, the violence of the mob was so great he had to be carried by the soldiers. The crowd that followed kept shouting, “Get rid of him!” As the soldiers were about to take Paul into the barracks, he asked the commander, “May I say something to you?”\n“Do you speak Greek?” he replied. “Aren’t you the Egyptian who started a revolt and led four thousand terrorists out into the wilderness some time ago?” Paul answered, “I am a Jew, from Tarsus in Cilicia, a citizen of no ordinary city. Please let me speak to the people.” After receiving the commander’s permission, Paul stood on the steps and motioned to the crowd. When they were all silent, he said to them in Aramaic: \n\n“Brothers and fathers, listen now to my defense.” When they heard him speak to them in Aramaic, they became very quiet.\nThen Paul said: “I am a Jew, born in Tarsus of Cilicia, but brought up in this city. I studied under Gamaliel and was thoroughly trained in the law of our ancestors. I was just as zealous for God as any of you are today. I persecuted the followers of this Way to their death, arresting both men and women and throwing them into prison, as the high priest and all the Council can themselves testify. I even obtained letters from them to their associates in Damascus, and went there to bring these people as prisoners to Jerusalem to be punished. “About noon as I came near Damascus, suddenly a bright light from heaven flashed around me. I fell to the ground and heard a voice say to me, ‘Saul! Saul! Why do you persecute me?’ “‘Who are you, Lord?’ I asked.\n“ ‘I am Jesus of Nazareth, whom you are persecuting,’ he replied. My companions saw the light, but they did not understand the voice of him who was speaking to me. “‘What shall I do, Lord?’ I asked.\n“ ‘Get up,’ the Lord said, ‘and go into Damascus. There you will be told all that you have been assigned to do.’ My companions led me by the hand into Damascus, because the brilliance of the light had blinded me. “A man named Ananias came to see me. He was a devout observer of the law and highly respected by all the Jews living there. He stood beside me and said, ‘Brother Saul, receive your sight!’ And at that very moment I was able to see him. “Then he said: ‘The God of our ancestors has chosen you to know his will and to see the Righteous One and to hear words from his mouth. You will be his witness to all people of what you have seen and heard. And now what are you waiting for? Get up, be baptized and wash your sins away, calling on his name.’ “When I returned to Jerusalem and was praying at the temple, I fell into a trance and saw the Lord speaking to me. ‘Quick!’ he said. ‘Leave Jerusalem immediately, because the people here will not accept your testimony about me.’ “‘Lord,’ I replied, ‘these people know that I went from one synagogue to another to imprison and beat those who believe in you. And when the blood of your martyr Stephen was shed, I stood there giving my approval and guarding the clothes of those who were killing him.’ “Then the Lord said to me, ‘Go; I will send you far away to the Gentiles.’ ” The crowd listened to Paul until he said this. Then they raised their voices and shouted, “Rid the earth of him! He’s not fit to live!” As they were shouting and throwing off their cloaks and flinging dust into the air, the commander ordered that Paul be taken into the barracks. He directed that he be flogged and interrogated in order to find out why the people were shouting at him like this. As they stretched him out to flog him, Paul said to the centurion standing there, “Is it legal for you to flog a Roman citizen who hasn’t even been found guilty?” When the centurion heard this, he went to the commander and reported it. “What are you going to do?” he asked. “This man is a Roman citizen.” The commander went to Paul and asked, “Tell me, are you a Roman citizen?”\n“Yes, I am,” he answered. Then the commander said, “I had to pay a lot of money for my citizenship.”\n“But I was born a citizen,” Paul replied. Those who were about to interrogate him withdrew immediately. The commander himself was alarmed when he realized that he had put Paul, a Roman citizen, in chains. The commander wanted to find out exactly why Paul was being accused by the Jews. So the next day he released him and ordered the chief priests and all the members of the Sanhedrin to assemble. Then he brought Paul and had him stand before them. \n\nPaul looked straight at the Sanhedrin and said, “My brothers, I have fulfilled my duty to God in all good conscience to this day.” At this the high priest Ananias ordered those standing near Paul to strike him on the mouth. Then Paul said to him, “God will strike you, you whitewashed wall! You sit there to judge me according to the law, yet you yourself violate the law by commanding that I be struck!” Those who were standing near Paul said, “How dare you insult God’s high priest!” Paul replied, “Brothers, I did not realize that he was the high priest; for it is written: ‘Do not speak evil about the ruler of your people.’” Then Paul, knowing that some of them were Sadducees and the others Pharisees, called out in the Sanhedrin, “My brothers, I am a Pharisee, descended from Pharisees. I stand on trial because of the hope of the resurrection of the dead.” When he said this, a dispute broke out between the Pharisees and the Sadducees, and the assembly was divided. (The Sadducees say that there is no resurrection, and that there are neither angels nor spirits, but the Pharisees believe all these things.) There was a great uproar, and some of the teachers of the law who were Pharisees stood up and argued vigorously. “We find nothing wrong with this man,” they said. “What if a spirit or an angel has spoken to him?” The dispute became so violent that the commander was afraid Paul would be torn to pieces by them. He ordered the troops to go down and take him away from them by force and bring him into the barracks. The following night the Lord stood near Paul and said, “Take courage! As you have testified about me in Jerusalem, so you must also testify in Rome.” The next morning some Jews formed a conspiracy and bound themselves with an oath not to eat or drink until they had killed Paul. More than forty men were involved in this plot. They went to the chief priests and the elders and said, “We have taken a solemn oath not to eat anything until we have killed Paul. Now then, you and the Sanhedrin petition the commander to bring him before you on the pretext of wanting more accurate information about his case. We are ready to kill him before he gets here.” But when the son of Paul’s sister heard of this plot, he went into the barracks and told Paul. Then Paul called one of the centurions and said, “Take this young man to the commander; he has something to tell him.” So he took him to the commander.\nThe centurion said, “Paul, the prisoner, sent for me and asked me to bring this young man to you because he has something to tell you.” The commander took the young man by the hand, drew him aside and asked, “What is it you want to tell me?” He said: “Some Jews have agreed to ask you to bring Paul before the Sanhedrin tomorrow on the pretext of wanting more accurate information about him. Don’t give in to them, because more than forty of them are waiting in ambush for him. They have taken an oath not to eat or drink until they have killed him. They are ready now, waiting for your consent to their request.” The commander dismissed the young man with this warning: “Don’t tell anyone that you have reported this to me.” Then he called two of his centurions and ordered them, “Get ready a detachment of two hundred soldiers, seventy horsemen and two hundred spearmen to go to Caesarea at nine tonight. Provide horses for Paul so that he may be taken safely to Governor Felix.” He wrote a letter as follows: Claudius Lysias,\nTo His Excellency, Governor Felix:\nGreetings. This man was seized by the Jews and they were about to kill him, but I came with my troops and rescued him, for I had learned that he is a Roman citizen. I wanted to know why they were accusing him, so I brought him to their Sanhedrin. I found that the accusation had to do with questions about their law, but there was no charge against him that deserved death or imprisonment. When I was informed of a plot to be carried out against the man, I sent him to you at once. I also ordered his accusers to present to you their case against him. So the soldiers, carrying out their orders, took Paul with them during the night and brought him as far as Antipatris. The next day they let the cavalry go on with him, while they returned to the barracks. When the cavalry arrived in Caesarea, they delivered the letter to the governor and handed Paul over to him. The governor read the letter and asked what province he was from. Learning that he was from Cilicia, he said, “I will hear your case when your accusers get here.” Then he ordered that Paul be kept under guard in Herod’s palace. \n\nFive days later the high priest Ananias went down to Caesarea with some of the elders and a lawyer named Tertullus, and they brought their charges against Paul before the governor. When Paul was called in, Tertullus presented his case before Felix: “We have enjoyed a long period of peace under you, and your foresight has brought about reforms in this nation. Everywhere and in every way, most excellent Felix, we acknowledge this with profound gratitude. But in order not to weary you further, I would request that you be kind enough to hear us briefly. “We have found this man to be a troublemaker, stirring up riots among the Jews all over the world. He is a ringleader of the Nazarene sect and even tried to desecrate the temple; so we seized him.  By examining him yourself you will be able to learn the truth about all these charges we are bringing against him.” The other Jews joined in the accusation, asserting that these things were true. When the governor motioned for him to speak, Paul replied: “I know that for a number of years you have been a judge over this nation; so I gladly make my defense. You can easily verify that no more than twelve days ago I went up to Jerusalem to worship. My accusers did not find me arguing with anyone at the temple, or stirring up a crowd in the synagogues or anywhere else in the city. And they cannot prove to you the charges they are now making against me. However, I admit that I worship the God of our ancestors as a follower of the Way, which they call a sect. I believe everything that is in accordance with the Law and that is written in the Prophets, and I have the same hope in God as these men themselves have, that there will be a resurrection of both the righteous and the wicked. So I strive always to keep my conscience clear before God and man. “After an absence of several years, I came to Jerusalem to bring my people gifts for the poor and to present offerings. I was ceremonially clean when they found me in the temple courts doing this. There was no crowd with me, nor was I involved in any disturbance. But there are some Jews from the province of Asia, who ought to be here before you and bring charges if they have anything against me. Or these who are here should state what crime they found in me when I stood before the Sanhedrin— unless it was this one thing I shouted as I stood in their presence: ‘It is concerning the resurrection of the dead that I am on trial before you today.’” Then Felix, who was well acquainted with the Way, adjourned the proceedings. “When Lysias the commander comes,” he said, “I will decide your case.” He ordered the centurion to keep Paul under guard but to give him some freedom and permit his friends to take care of his needs. Several days later Felix came with his wife Drusilla, who was Jewish. He sent for Paul and listened to him as he spoke about faith in Christ Jesus. As Paul talked about righteousness, self-control and the judgment to come, Felix was afraid and said, “That’s enough for now! You may leave. When I find it convenient, I will send for you.” At the same time he was hoping that Paul would offer him a bribe, so he sent for him frequently and talked with him. When two years had passed, Felix was succeeded by Porcius Festus, but because Felix wanted to grant a favor to the Jews, he left Paul in prison. \n\nThree days after arriving in the province, Festus went up from Caesarea to Jerusalem, where the chief priests and the Jewish leaders appeared before him and presented the charges against Paul. They requested Festus, as a favor to them, to have Paul transferred to Jerusalem, for they were preparing an ambush to kill him along the way. Festus answered, “Paul is being held at Caesarea, and I myself am going there soon. Let some of your leaders come with me, and if the man has done anything wrong, they can press charges against him there.” After spending eight or ten days with them, Festus went down to Caesarea. The next day he convened the court and ordered that Paul be brought before him. When Paul came in, the Jews who had come down from Jerusalem stood around him. They brought many serious charges against him, but they could not prove them. Then Paul made his defense: “I have done nothing wrong against the Jewish law or against the temple or against Caesar.” Festus, wishing to do the Jews a favor, said to Paul, “Are you willing to go up to Jerusalem and stand trial before me there on these charges?” Paul answered: “I am now standing before Caesar’s court, where I ought to be tried. I have not done any wrong to the Jews, as you yourself know very well. If, however, I am guilty of doing anything deserving death, I do not refuse to die. But if the charges brought against me by these Jews are not true, no one has the right to hand me over to them. I appeal to Caesar!” After Festus had conferred with his council, he declared: “You have appealed to Caesar. To Caesar you will go!” A few days later King Agrippa and Bernice arrived at Caesarea to pay their respects to Festus. Since they were spending many days there, Festus discussed Paul’s case with the king. He said: “There is a man here whom Felix left as a prisoner. When I went to Jerusalem, the chief priests and the elders of the Jews brought charges against him and asked that he be condemned. “I told them that it is not the Roman custom to hand over anyone before they have faced their accusers and have had an opportunity to defend themselves against the charges. When they came here with me, I did not delay the case, but convened the court the next day and ordered the man to be brought in. When his accusers got up to speak, they did not charge him with any of the crimes I had expected. Instead, they had some points of dispute with him about their own religion and about a dead man named Jesus who Paul claimed was alive. I was at a loss how to investigate such matters; so I asked if he would be willing to go to Jerusalem and stand trial there on these charges. But when Paul made his appeal to be held over for the Emperor’s decision, I ordered him held until I could send him to Caesar.” Then Agrippa said to Festus, “I would like to hear this man myself.”\nHe replied, “Tomorrow you will hear him.” The next day Agrippa and Bernice came with great pomp and entered the audience room with the high-ranking military officers and the prominent men of the city. At the command of Festus, Paul was brought in. Festus said: “King Agrippa, and all who are present with us, you see this man! The whole Jewish community has petitioned me about him in Jerusalem and here in Caesarea, shouting that he ought not to live any longer. I found he had done nothing deserving of death, but because he made his appeal to the Emperor I decided to send him to Rome. But I have nothing definite to write to His Majesty about him. Therefore I have brought him before all of you, and especially before you, King Agrippa, so that as a result of this investigation I may have something to write. For I think it is unreasonable to send a prisoner on to Rome without specifying the charges against him.” \n\nThen Agrippa said to Paul, “You have permission to speak for yourself.”\nSo Paul motioned with his hand and began his defense: “King Agrippa, I consider myself fortunate to stand before you today as I make my defense against all the accusations of the Jews, and especially so because you are well acquainted with all the Jewish customs and controversies. Therefore, I beg you to listen to me patiently. “The Jewish people all know the way I have lived ever since I was a child, from the beginning of my life in my own country, and also in Jerusalem. They have known me for a long time and can testify, if they are willing, that I conformed to the strictest sect of our religion, living as a Pharisee. And now it is because of my hope in what God has promised our ancestors that I am on trial today. This is the promise our twelve tribes are hoping to see fulfilled as they earnestly serve God day and night. King Agrippa, it is because of this hope that these Jews are accusing me. Why should any of you consider it incredible that God raises the dead? “I too was convinced that I ought to do all that was possible to oppose the name of Jesus of Nazareth. And that is just what I did in Jerusalem. On the authority of the chief priests I put many of the Lord’s people in prison, and when they were put to death, I cast my vote against them. Many a time I went from one synagogue to another to have them punished, and I tried to force them to blaspheme. I was so obsessed with persecuting them that I even hunted them down in foreign cities. “On one of these journeys I was going to Damascus with the authority and commission of the chief priests. About noon, King Agrippa, as I was on the road, I saw a light from heaven, brighter than the sun, blazing around me and my companions. We all fell to the ground, and I heard a voice saying to me in Aramaic, ‘Saul, Saul, why do you persecute me? It is hard for you to kick against the goads.’ “Then I asked, ‘Who are you, Lord?’\n“ ‘I am Jesus, whom you are persecuting,’ the Lord replied. ‘Now get up and stand on your feet. I have appeared to you to appoint you as a servant and as a witness of what you have seen and will see of me. I will rescue you from your own people and from the Gentiles. I am sending you to them to open their eyes and turn them from darkness to light, and from the power of Satan to God, so that they may receive forgiveness of sins and a place among those who are sanctified by faith in me.’ “So then, King Agrippa, I was not disobedient to the vision from heaven. First to those in Damascus, then to those in Jerusalem and in all Judea, and then to the Gentiles, I preached that they should repent and turn to God and demonstrate their repentance by their deeds. That is why some Jews seized me in the temple courts and tried to kill me. But God has helped me to this very day; so I stand here and testify to small and great alike. I am saying nothing beyond what the prophets and Moses said would happen— that the Messiah would suffer and, as the first to rise from the dead, would bring the message of light to his own people and to the Gentiles.” At this point Festus interrupted Paul’s defense. “You are out of your mind, Paul!” he shouted. “Your great learning is driving you insane.” “I am not insane, most excellent Festus,” Paul replied. “What I am saying is true and reasonable. The king is familiar with these things, and I can speak freely to him. I am convinced that none of this has escaped his notice, because it was not done in a corner. King Agrippa, do you believe the prophets? I know you do.” Then Agrippa said to Paul, “Do you think that in such a short time you can persuade me to be a Christian?” Paul replied, “Short time or long—I pray to God that not only you but all who are listening to me today may become what I am, except for these chains.” The king rose, and with him the governor and Bernice and those sitting with them. After they left the room, they began saying to one another, “This man is not doing anything that deserves death or imprisonment.” Agrippa said to Festus, “This man could have been set free if he had not appealed to Caesar.” \n\nWhen it was decided that we would sail for Italy, Paul and some other prisoners were handed over to a centurion named Julius, who belonged to the Imperial Regiment. We boarded a ship from Adramyttium about to sail for ports along the coast of the province of Asia, and we put out to sea. Aristarchus, a Macedonian from Thessalonica, was with us. The next day we landed at Sidon; and Julius, in kindness to Paul, allowed him to go to his friends so they might provide for his needs. From there we put out to sea again and passed to the lee of Cyprus because the winds were against us. When we had sailed across the open sea off the coast of Cilicia and Pamphylia, we landed at Myra in Lycia. There the centurion found an Alexandrian ship sailing for Italy and put us on board. We made slow headway for many days and had difficulty arriving off Cnidus. When the wind did not allow us to hold our course, we sailed to the lee of Crete, opposite Salmone. We moved along the coast with difficulty and came to a place called Fair Havens, near the town of Lasea. Much time had been lost, and sailing had already become dangerous because by now it was after the Day of Atonement. So Paul warned them, “Men, I can see that our voyage is going to be disastrous and bring great loss to ship and cargo, and to our own lives also.” But the centurion, instead of listening to what Paul said, followed the advice of the pilot and of the owner of the ship. Since the harbor was unsuitable to winter in, the majority decided that we should sail on, hoping to reach Phoenix and winter there. This was a harbor in Crete, facing both southwest and northwest. When a gentle south wind began to blow, they saw their opportunity; so they weighed anchor and sailed along the shore of Crete. Before very long, a wind of hurricane force, called the Northeaster, swept down from the island. The ship was caught by the storm and could not head into the wind; so we gave way to it and were driven along. As we passed to the lee of a small island called Cauda, we were hardly able to make the lifeboat secure, so the men hoisted it aboard. Then they passed ropes under the ship itself to hold it together. Because they were afraid they would run aground on the sandbars of Syrtis, they lowered the sea anchor and let the ship be driven along. We took such a violent battering from the storm that the next day they began to throw the cargo overboard. On the third day, they threw the ship’s tackle overboard with their own hands. When neither sun nor stars appeared for many days and the storm continued raging, we finally gave up all hope of being saved. After they had gone a long time without food, Paul stood up before them and said: “Men, you should have taken my advice not to sail from Crete; then you would have spared yourselves this damage and loss. But now I urge you to keep up your courage, because not one of you will be lost; only the ship will be destroyed. Last night an angel of the God to whom I belong and whom I serve stood beside me and said, ‘Do not be afraid, Paul. You must stand trial before Caesar; and God has graciously given you the lives of all who sail with you.’ So keep up your courage, men, for I have faith in God that it will happen just as he told me. Nevertheless, we must run aground on some island.” On the fourteenth night we were still being driven across the Adriatic Sea, when about midnight the sailors sensed they were approaching land. They took soundings and found that the water was a hundred and twenty feet deep. A short time later they took soundings again and found it was ninety feet deep. Fearing that we would be dashed against the rocks, they dropped four anchors from the stern and prayed for daylight. In an attempt to escape from the ship, the sailors let the lifeboat down into the sea, pretending they were going to lower some anchors from the bow. Then Paul said to the centurion and the soldiers, “Unless these men stay with the ship, you cannot be saved.” So the soldiers cut the ropes that held the lifeboat and let it drift away. Just before dawn Paul urged them all to eat. “For the last fourteen days,” he said, “you have been in constant suspense and have gone without food—you haven’t eaten anything. Now I urge you to take some food. You need it to survive. Not one of you will lose a single hair from his head.” After he said this, he took some bread and gave thanks to God in front of them all. Then he broke it and began to eat. They were all encouraged and ate some food themselves. Altogether there were 276 of us on board. When they had eaten as much as they wanted, they lightened the ship by throwing the grain into the sea. When daylight came, they did not recognize the land, but they saw a bay with a sandy beach, where they decided to run the ship aground if they could. Cutting loose the anchors, they left them in the sea and at the same time untied the ropes that held the rudders. Then they hoisted the foresail to the wind and made for the beach. But the ship struck a sandbar and ran aground. The bow stuck fast and would not move, and the stern was broken to pieces by the pounding of the surf. The soldiers planned to kill the prisoners to prevent any of them from swimming away and escaping. But the centurion wanted to spare Paul’s life and kept them from carrying out their plan. He ordered those who could swim to jump overboard first and get to land. The rest were to get there on planks or on other pieces of the ship. In this way everyone reached land safely. \n\nOnce safely on shore, we found out that the island was called Malta. The islanders showed us unusual kindness. They built a fire and welcomed us all because it was raining and cold. Paul gathered a pile of brushwood and, as he put it on the fire, a viper, driven out by the heat, fastened itself on his hand. When the islanders saw the snake hanging from his hand, they said to each other, “This man must be a murderer; for though he escaped from the sea, the goddess Justice has not allowed him to live.” But Paul shook the snake off into the fire and suffered no ill effects. The people expected him to swell up or suddenly fall dead; but after waiting a long time and seeing nothing unusual happen to him, they changed their minds and said he was a god. There was an estate nearby that belonged to Publius, the chief official of the island. He welcomed us to his home and showed us generous hospitality for three days. His father was sick in bed, suffering from fever and dysentery. Paul went in to see him and, after prayer, placed his hands on him and healed him. When this had happened, the rest of the sick on the island came and were cured. They honored us in many ways; and when we were ready to sail, they furnished us with the supplies we needed. After three months we put out to sea in a ship that had wintered in the island—it was an Alexandrian ship with the figurehead of the twin gods Castor and Pollux. We put in at Syracuse and stayed there three days. From there we set sail and arrived at Rhegium. The next day the south wind came up, and on the following day we reached Puteoli. There we found some brothers and sisters who invited us to spend a week with them. And so we came to Rome. The brothers and sisters there had heard that we were coming, and they traveled as far as the Forum of Appius and the Three Taverns to meet us. At the sight of these people Paul thanked God and was encouraged. When we got to Rome, Paul was allowed to live by himself, with a soldier to guard him. Three days later he called together the local Jewish leaders. When they had assembled, Paul said to them: “My brothers, although I have done nothing against our people or against the customs of our ancestors, I was arrested in Jerusalem and handed over to the Romans. They examined me and wanted to release me, because I was not guilty of any crime deserving death. The Jews objected, so I was compelled to make an appeal to Caesar. I certainly did not intend to bring any charge against my own people. For this reason I have asked to see you and talk with you. It is because of the hope of Israel that I am bound with this chain.” They replied, “We have not received any letters from Judea concerning you, and none of our people who have come from there has reported or said anything bad about you. But we want to hear what your views are, for we know that people everywhere are talking against this sect.” They arranged to meet Paul on a certain day, and came in even larger numbers to the place where he was staying. He witnessed to them from morning till evening, explaining about the kingdom of God, and from the Law of Moses and from the Prophets he tried to persuade them about Jesus. Some were convinced by what he said, but others would not believe. They disagreed among themselves and began to leave after Paul had made this final statement: “The Holy Spirit spoke the truth to your ancestors when he said through Isaiah the prophet: “‘Go to this people and say,\n“You will be ever hearing but never understanding;\n    you will be ever seeing but never perceiving.” For this people’s heart has become calloused;\n    they hardly hear with their ears,\n    and they have closed their eyes.\nOtherwise they might see with their eyes,\n    hear with their ears,\n    understand with their hearts\nand turn, and I would heal them.’ “Therefore I want you to know that God’s salvation has been sent to the Gentiles, and they will listen!”  For two whole years Paul stayed there in his own rented house and welcomed all who came to see him. He proclaimed the kingdom of God and taught about the Lord Jesus Christ—with all boldness and without hindrance! \n\n",
    "offsets": {
        "1": {
            "1": 0,
            "2": 85,
            "3": 207,
            "4": 392,
            "5": 571,
            "6": 663,
            "7": 777,
            "8": 881,
            "9": 1047,
            "10": 1145,
            "11": 1263,
            "12": 1461,
            "13": 1579,
            "14": 1816,
            "15": 1937,
            "16": 2033,
            "17": 2222,
            "18": 2276,
            "19": 2428,
            "20": 2548,
            "21": 2725,
            "22": 2849,
            "23": 2993,
            "24": 3081,
            "25": 3176,
            "26": 3256
        },
        "2": {
            "1": 3349,
            "2": 3418,
            "3": 3539,
            "4": 3631,
            "5": 3740,
            "6": 3825,
            "7": 3948,
            "8": 4022,
            "9": 4088,
            "10": 4184,
            "11": 4268,
            "12": 4386,
            "13": 4455,
            "14": 4528,
            "15": 4718,
            "16": 4793,
            "17": 4842,
            "18": 5029,
            "19": 5143,
            "20": 5259,
            "21": 5385,
            "22": 5452,
            "23": 5634,
            "24": 5794,
            "25": 5926,
            "26": 6045,
            "27": 6132,
            "28": 6236,
            "29": 6330,
            "30": 6457,
            "31": 6579,
            "32": 6729,
            "33": 6796,
            "34": 6933,
            "35": 7040,
            "36": 7099,
            "37": 7214,
            "38": 7341,
            "39": 7511,
            "40": 7622,
            "41": 7734,
            "42": 7842,
            "43": 7951,
            "44": 8037,
            "45": 8099,
            "46": 8166,
            "47": 8309
        },
        "3": {
            "1": 8435,
            "2": 8535,
            "3": 8699,
            "4": 8767,
            "5": 8841,
            "6": 8915,
            "7": 9042,
            "8": 9145,
            "9": 9272,
            "10": 9326,
            "11": 9499,
            "12": 9637,
            "13": 9809,
            "14": 10010,
            "15": 10096,
            "16": 10187,
            "17": 10373,
            "18": 10455,
            "19": 10570,
            "20": 10686,
            "21": 10763,
            "22": 10890,
            "23": 11037,
            "24": 11118,
            "25": 11209,
            "26": 11374
        },
        "4": {
            "1": 11493,
            "2": 11625,
            "3": 11751,
            "4": 11849,
            "5": 11953,
            "6": 12035,
            "7": 12146,
            "8": 12264,
            "9": 12353,
            "10": 12483,
            "11": 12674,
            "12": 12757,
            "13": 12877,
            "14": 13051,
            "15": 13164,
            "16": 13245,
            "17": 13394,
            "18": 13524,
            "19": 13625,
            "20": 13732,
            "21": 13803,
            "22": 13949,
            "23": 14015,
            "24": 14151,
            "25": 14327,
            "26": 14469,
            "27": 14585,
            "28": 14750,
            "29": 14822,
            "30": 14921,
            "31": 15027,
            "32": 15172,
            "33": 15315,
            "34": 15459,
            "35": 15601,
            "36": 15682,
            "37": 15784
        },
        "5": {
            "1": 15864,
            "2": 15953,
            "3": 16083,
            "4": 16266,
            "5": 16463,
            "6": 16566,
            "7": 16657,
            "8": 16730,
            "9": 16848,
            "10": 17027,
            "11": 17179,
            "12": 17252,
            "13": 17384,
            "14": 17466,
            "15": 17561,
            "16": 17722,
            "17": 17864,
            "18": 17984,
            "19": 18044,
            "20": 18137,
            "21": 18227,
            "22": 18490,
            "23": 18589,
            "24": 18714,
            "25": 18843,
            "26": 18958,
            "27": 19106,
            "28": 19212,
            "29": 19385,
            "30": 19467,
            "31": 19562,
            "32": 19686,
            "33": 19790,
            "34": 19863,
            "35": 20037,
            "36": 20141,
            "37": 20318,
            "38": 20476,
            "39": 20624,
            "40": 20740,
            "41": 20892,
            "42": 21008
        },
        "6": {
            "1": 21156,
            "2": 21361,
            "3": 21522,
            "4": 21673,
            "5": 21742,
            "6": 21942,
            "7": 22025,
            "8": 22168,
            "9": 22270,
            "10": 22470,
            "11": 22550,
            "12": 22675,
            "13": 22807,
            "14": 22932,
            "15": 23059
        },
        "7": {
            "1": 23185,
            "2": 23247,
            "3": 23414,
            "4": 23500,
            "5": 23644,
            "6": 23850,
            "7": 24009,
            "8": 24152,
            "9": 24384,
            "10": 24490,
            "11": 24671,
            "12": 24780,
            "13": 24874,
            "14": 24977,
            "15": 25065,
            "16": 25129,
            "17": 25280,
            "18": 25403,
            "19": 25476,
            "20": 25617,
            "21": 25726,
            "22": 25817,
            "23": 25910,
            "24": 25995,
            "25": 26114,
            "26": 26219,
            "27": 26381,
            "28": 26492,
            "29": 26562,
            "30": 26654,
            "31": 26776,
            "32": 26883,
            "33": 27003,
            "34": 27108,
            "35": 27272,
            "36": 27473,
            "37": 27594,
            "38": 27706,
            "39": 27867,
            "40": 27976,
            "41": 28120,
            "42": 28255,
            "43": 28506,
            "44": 28674,
            "45": 28835,
            "46": 29032,
            "47": 29127,
            "48": 29173,
            "49": 29263,
            "50": 29417,
            "51": 29457,
            "52": 29598,
            "53": 29771,
            "54": 29856,
            "55": 29952,
            "56": 30081,
            "57": 30172,
            "58": 30269,
            "59": 30402,
            "60": 30480
        },
        "8": {
            "1": 30605,
            "2": 30793,
            "3": 30846,
            "4": 30969,
            "5": 31036,
            "6": 31108,
            "7": 31216,
            "8": 31316,
            "9": 31353,
            "10": 31499,
            "11": 31631,
            "12": 31710,
            "13": 31863,
            "14": 31990,
            "15": 32107,
            "16": 32207,
            "17": 32325,
            "18": 32408,
            "19": 32512,
            "20": 32619,
            "21": 32730,
            "22": 32818,
            "23": 32942,
            "24": 33005,
            "25": 33100,
            "26": 33269,
            "27": 33388,
            "28": 33601,
            "29": 33688,
            "30": 33751,
            "31": 33887,
            "32": 33995,
            "33": 34177,
            "34": 34306,
            "35": 34409,
            "36": 34503,
            "37": 34652,
            "38": 34653,
            "39": 34775,
            "40": 34930
        },
        "9": {
            "1": 35053,
            "2": 35168,
            "3": 35348,
            "4": 35435,
            "5": 35526,
            "6": 35611,
            "7": 35685,
            "8": 35782,
            "9": 35904,
            "10": 35968,
            "11": 36089,
            "12": 36214,
            "13": 36313,
            "14": 36444,
            "15": 36541,
            "16": 36690,
            "17": 36744,
            "18": 36989,
            "19": 37099,
            "20": 37209,
            "21": 37284,
            "22": 37491,
            "23": 37606,
            "24": 37686,
            "25": 37794,
            "26": 37890,
            "27": 38027,
            "28": 38243,
            "29": 38346,
            "30": 38423,
            "31": 38518,
            "32": 38709,
            "33": 38801,
            "34": 38894,
            "35": 39005,
            "36": 39077,
            "37": 39200,
            "38": 39298,
            "39": 39436,
            "40": 39650,
            "41": 39838,
            "42": 39980,
            "43": 40052
        },
        "10": {
            "1": 40117,
            "2": 40217,
            "3": 40333,
            "4": 40464,
            "5": 40631,
            "6": 40706,
            "7": 40771,
            "8": 40902,
            "9": 40968,
            "10": 41088,
            "11": 41196,
            "12": 41295,
            "13": 41373,
            "14": 41427,
            "15": 41511,
            "16": 41604,
            "17": 41683,
            "18": 41827,
            "19": 41902,
            "20": 42014,
            "21": 42099,
            "22": 42189,
            "23": 42431,
            "24": 42582,
            "25": 42710,
            "26": 42791,
            "27": 42865,
            "28": 42946,
            "29": 43128,
            "30": 43222,
            "31": 43375,
            "32": 43462,
            "33": 43577,
            "34": 43747,
            "35": 43838,
            "36": 43914,
            "37": 44045,
            "38": 44165,
            "39": 44347,
            "40": 44474,
            "41": 44551,
            "42": 44693,
            "43": 44823,
            "44": 44940,
            "45": 45035,
            "46": 45172,
            "47": 45247,
            "48": 45372
        },
        "11": {
            "1": 45495,
            "2": 45602,
            "3": 45679,
            "4": 45755,
            "5": 45817,
            "6": 46002,
            "7": 46094,
            "8": 46158,
            "9": 46243,
            "10": 46342,
            "11": 46416,
            "12": 46518,
            "13": 46652,
            "14": 46763,
            "15": 46848,
            "16": 46938,
            "17": 47055,
            "18": 47192,
            "19": 47345,
            "20": 47522,
            "21": 47673,
            "22": 47766,
            "23": 47847,
            "24": 47989,
            "25": 48098,
            "26": 48145,
            "27": 48344,
            "28": 48412,
            "29": 48590,
            "30": 48697
        },
        "12": {
            "1": 48769,
            "2": 48879,
            "3": 48943,
            "4": 49088,
            "5": 49269,
            "6": 49351,
            "7": 49507,
            "8": 49688,
            "9": 49833,
            "10": 49977,
            "11": 50196,
            "12": 50396,
            "13": 50541,
            "14": 50629,
            "15": 50756,
            "16": 50873,
            "17": 50966,
            "18": 51179,
            "19": 51275,
            "20": 51465,
            "21": 51749,
            "22": 51866,
            "23": 51924,
            "24": 52053,
            "25": 52107
        },
        "13": {
            "1": 52231,
            "2": 52410,
            "3": 52560,
            "4": 52648,
            "5": 52758,
            "6": 52882,
            "7": 53016,
            "8": 53176,
            "9": 53295,
            "10": 53397,
            "11": 53578,
            "12": 53808,
            "13": 53913,
            "14": 54025,
            "15": 54126,
            "16": 54307,
            "17": 54425,
            "18": 54584,
            "19": 54650,
            "20": 54746,
            "21": 54849,
            "22": 54967,
            "23": 55145,
            "24": 55234,
            "25": 55328,
            "26": 55508,
            "27": 55624,
            "28": 55782,
            "29": 55879,
            "30": 55995,
            "31": 56029,
            "32": 56163,
            "33": 56223,
            "34": 56379,
            "35": 56534,
            "36": 56611,
            "37": 56746,
            "38": 56807,
            "39": 56915,
            "40": 57045,
            "41": 57112,
            "42": 57267,
            "43": 57397,
            "44": 57579,
            "45": 57660,
            "46": 57793,
            "47": 57989,
            "48": 58138,
            "49": 58271,
            "50": 58325,
            "51": 58520,
            "52": 58600
        },
        "14": {
            "1": 58667,
            "2": 58818,
            "3": 58931,
            "4": 59099,
            "5": 59188,
            "6": 59303,
            "7": 59416,
            "8": 59459,
            "9": 59553,
            "10": 59657,
            "11": 59744,
            "12": 59870,
            "13": 59959,
            "14": 60124,
            "15": 60244,
            "16": 60480,
            "17": 60530,
            "18": 60727,
            "19": 60814,
            "20": 60956,
            "21": 61089,
            "22": 61215,
            "23": 61369,
            "24": 61520,
            "25": 61575,
            "26": 61648,
            "27": 61777,
            "28": 61933
        },
        "15": {
            "1": 61989,
            "2": 62161,
            "3": 62377,
            "4": 62555,
            "5": 62706,
            "6": 62869,
            "7": 62924,
            "8": 63128,
            "9": 63240,
            "10": 63324,
            "11": 63462,
            "12": 63557,
            "13": 63710,
            "14": 63782,
            "15": 63884,
            "16": 63956,
            "17": 64073,
            "18": 64200,
            "19": 64228,
            "20": 64337,
            "21": 64498,
            "22": 64624,
            "23": 64855,
            "24": 65004,
            "25": 65130,
            "26": 65228,
            "27": 65299,
            "28": 65389,
            "29": 65500,
            "30": 65675,
            "31": 65792,
            "32": 65854,
            "33": 65954,
            "34": 66087,
            "35": 66088,
            "36": 66200,
            "37": 66364,
            "38": 66423,
            "39": 66554,
            "40": 66657,
            "41": 66741
        },
        "16": {
            "1": 66806,
            "2": 66952,
            "3": 67007,
            "4": 67166,
            "5": 67303,
            "6": 67377,
            "7": 67541,
            "8": 67659,
            "9": 67707,
            "10": 67828,
            "11": 67969,
            "12": 68075,
            "13": 68212,
            "14": 68384,
            "15": 68568,
            "16": 68759,
            "17": 68957,
            "18": 69093,
            "19": 69302,
            "20": 69459,
            "21": 69572,
            "22": 69641,
            "23": 69766,
            "24": 69888,
            "25": 69988,
            "26": 70105,
            "27": 70272,
            "28": 70425,
            "29": 70483,
            "30": 70565,
            "31": 70637,
            "32": 70726,
            "33": 70806,
            "34": 70935,
            "35": 71091,
            "36": 71200,
            "37": 71317,
            "38": 71545,
            "39": 71672,
            "40": 71768
        },
        "17": {
            "1": 71925,
            "2": 72062,
            "3": 72180,
            "4": 72320,
            "5": 72456,
            "6": 72689,
            "7": 72877,
            "8": 73014,
            "9": 73095,
            "10": 73158,
            "11": 73286,
            "12": 73487,
            "13": 73589,
            "14": 73753,
            "15": 73842,
            "16": 73975,
            "17": 74084,
            "18": 74233,
            "19": 74510,
            "20": 74664,
            "21": 74756,
            "22": 74895,
            "23": 75023,
            "24": 75257,
            "25": 75389,
            "26": 75523,
            "27": 75689,
            "28": 75815,
            "29": 75926,
            "30": 76082,
            "31": 76178,
            "32": 76340,
            "33": 76476,
            "34": 76508
        },
        "18": {
            "1": 76673,
            "2": 76723,
            "3": 76910,
            "4": 76987,
            "5": 77067,
            "6": 77209,
            "7": 77405,
            "8": 77504,
            "9": 77653,
            "10": 77754,
            "11": 77859,
            "12": 77939,
            "13": 78068,
            "14": 78165,
            "15": 78345,
            "16": 78485,
            "17": 78507,
            "18": 78648,
            "19": 78872,
            "20": 78998,
            "21": 79061,
            "22": 79161,
            "23": 79267,
            "24": 79440,
            "25": 79579,
            "26": 79733,
            "27": 79897,
            "28": 80096
        },
        "19": {
            "1": 80219,
            "2": 80343,
            "3": 80485,
            "4": 80569,
            "5": 80704,
            "6": 80771,
            "7": 80879,
            "8": 80915,
            "9": 81030,
            "10": 81229,
            "11": 81351,
            "12": 81396,
            "13": 81542,
            "14": 81763,
            "15": 81824,
            "16": 81919,
            "17": 82076,
            "18": 82228,
            "19": 82305,
            "20": 82487,
            "21": 82553,
            "22": 82715,
            "23": 82835,
            "24": 82898,
            "25": 83019,
            "26": 83169,
            "27": 83385,
            "28": 83653,
            "29": 83750,
            "30": 83923,
            "31": 84000,
            "32": 84125,
            "33": 84258,
            "34": 84419,
            "35": 84541,
            "36": 84748,
            "37": 84842,
            "38": 84943,
            "39": 85092,
            "40": 85183,
            "41": 85371
        },
        "20": {
            "1": 85424,
            "2": 85548,
            "3": 85662,
            "4": 85815,
            "5": 86002,
            "6": 86054,
            "7": 86198,
            "8": 86365,
            "9": 86431,
            "10": 86635,
            "11": 86754,
            "12": 86846,
            "13": 86915,
            "14": 87072,
            "15": 87141,
            "16": 87290,
            "17": 87456,
            "18": 87521,
            "19": 87663,
            "20": 87788,
            "21": 87925,
            "22": 88040,
            "23": 88142,
            "24": 88239,
            "25": 88428,
            "26": 88532,
            "27": 88613,
            "28": 88680,
            "29": 88845,
            "30": 88939,
            "31": 89046,
            "32": 89159,
            "33": 89301,
            "34": 89357,
            "35": 89461,
            "36": 89648,
            "37": 89724,
            "38": 89775
        },
        "21": {
            "1": 89899,
            "2": 90046,
            "3": 90118,
            "4": 90254,
            "5": 90383,
            "6": 90560,
            "7": 90645,
            "8": 90778,
            "9": 90888,
            "10": 90936,
            "11": 91023,
            "12": 91252,
            "13": 91341,
            "14": 91500,
            "15": 91580,
            "16": 91631,
            "17": 91800,
            "18": 91875,
            "19": 91964,
            "20": 92064,
            "21": 92230,
            "22": 92415,
            "23": 92478,
            "24": 92550,
            "25": 92793,
            "26": 92992,
            "27": 93204,
            "28": 93350,
            "29": 93565,
            "30": 93692,
            "31": 93854,
            "32": 93988,
            "33": 94138,
            "34": 94269,
            "35": 94446,
            "36": 94550,
            "37": 94607,
            "38": 94754,
            "39": 94873,
            "40": 94992
        },
        "22": {
            "1": 95144,
            "2": 95194,
            "3": 95280,
            "4": 95485,
            "5": 95600,
            "6": 95809,
            "7": 95901,
            "8": 95990,
            "9": 96087,
            "10": 96185,
            "11": 96333,
            "12": 96433,
            "13": 96557,
            "14": 96669,
            "15": 96805,
            "16": 96876,
            "17": 96977,
            "18": 97059,
            "19": 97206,
            "20": 97334,
            "21": 97476,
            "22": 97553,
            "23": 97689,
            "24": 97773,
            "25": 97949,
            "26": 98112,
            "27": 98254,
            "28": 98354,
            "29": 98471,
            "30": 98634
        },
        "23": {
            "1": 98881,
            "2": 99012,
            "3": 99105,
            "4": 99286,
            "5": 99367,
            "6": 99511,
            "7": 99746,
            "8": 99856,
            "9": 99998,
            "10": 100211,
            "11": 100412,
            "12": 100562,
            "13": 100691,
            "14": 100739,
            "15": 100871,
            "16": 101065,
            "17": 101160,
            "18": 101279,
            "19": 101448,
            "20": 101554,
            "21": 101704,
            "22": 101926,
            "23": 102038,
            "24": 102219,
            "25": 102294,
            "26": 102324,
            "27": 102387,
            "28": 102541,
            "29": 102623,
            "30": 102766,
            "31": 102928,
            "32": 103047,
            "33": 103134,
            "34": 103243,
            "35": 103344
        },
        "24": {
            "1": 103473,
            "2": 103654,
            "3": 103834,
            "4": 103930,
            "5": 104029,
            "6": 104168,
            "7": 104226,
            "8": 104227,
            "9": 104343,
            "10": 104423,
            "11": 104586,
            "12": 104677,
            "13": 104811,
            "14": 104884,
            "15": 105084,
            "16": 105218,
            "17": 105285,
            "18": 105405,
            "19": 105549,
            "20": 105684,
            "21": 105782,
            "22": 105937,
            "23": 106085,
            "24": 106214,
            "25": 106362,
            "26": 106552,
            "27": 106669
        },
        "25": {
            "1": 106816,
            "2": 106902,
            "3": 107009,
            "4": 107152,
            "5": 107236,
            "6": 107358,
            "7": 107512,
            "8": 107669,
            "9": 107789,
            "10": 107933,
            "11": 108088,
            "12": 108305,
            "13": 108417,
            "14": 108512,
            "15": 108659,
            "16": 108790,
            "17": 108963,
            "18": 109092,
            "19": 109190,
            "20": 109326,
            "21": 109468,
            "22": 109596,
            "23": 109707,
            "24": 109913,
            "25": 110129,
            "26": 110254,
            "27": 110479
        },
        "26": {
            "1": 110587,
            "2": 110713,
            "3": 110844,
            "4": 110989,
            "5": 111136,
            "6": 111287,
            "7": 111385,
            "8": 111568,
            "9": 111639,
            "10": 111742,
            "11": 111927,
            "12": 112127,
            "13": 112233,
            "14": 112368,
            "15": 112525,
            "16": 112621,
            "17": 112767,
            "18": 112854,
            "19": 113052,
            "20": 113125,
            "21": 113324,
            "22": 113399,
            "23": 113567,
            "24": 113711,
            "25": 113851,
            "26": 113949,
            "27": 114114,
            "28": 114173,
            "29": 114280,
            "30": 114432,
            "31": 114514,
            "32": 114644
        },
        "27": {
            "1": 114740,
            "2": 114905,
            "3": 115086,
            "4": 115222,
            "5": 115324,
            "6": 115431,
            "7": 115516,
            "8": 115691,
            "9": 115796,
            "10": 115933,
            "11": 116059,
            "12": 116181,
            "13": 116379,
            "14": 116507,
            "15": 116604,
            "16": 116715,
            "17": 116820,
            "18": 117053,
            "19": 117160,
            "20": 117239,
            "21": 117365,
            "22": 117569,
            "23": 117683,
            "24": 117764,
            "25": 117905,
            "26": 117999,
            "27": 118050,
            "28": 118193,
            "29": 118354,
            "30": 118471,
            "31": 118621,
            "32": 118731,
            "33": 118807,
            "34": 118982,
            "35": 119095,
            "36": 119214,
            "37": 119269,
            "38": 119311,
            "39": 119415,
            "40": 119565,
            "41": 119746,
            "42": 119896,
            "43": 119995,
            "44": 120158
        },
        "28": {
            "1": 120271,
            "2": 120340,
            "3": 120453,
            "4": 120580,
            "5": 120777,
            "6": 120849,
            "7": 121028,
            "8": 121193,
            "9": 121340,
            "10": 121420,
            "11": 121529,
            "12": 121691,
            "13": 121742,
            "14": 121871,
            "15": 121978,
            "16": 122188,
            "17": 122275,
            "18": 122543,
            "19": 122641,
            "20": 122778,
            "21": 122907,
            "22": 123075,
            "23": 123183,
            "24": 123467,
            "25": 123534,
            "26": 123719,
            "27": 123850,
            "28": 124106,
            "29": 124211,
            "30": 124212,
            "31": 124312
        }
    }
}