{
    "text": "The word of the Lord that came to Zephaniah son of Cushi, the son of Gedaliah, the son of Amariah, the son of Hezekiah, during the reign of Josiah son of Amon king of Judah: “I will sweep away everything\n    from the face of the earth,”\ndeclares the Lord. “I will sweep away both man and beast;\n    I will sweep away the birds in the sky\n    and the fish in the sea—\n    and the idols that cause the wicked to stumble.”\n“When I destroy all mankind\n    on the face of the earth,”\ndeclares the Lord, “I will stretch out my hand against Judah\n    and against all who live in Jerusalem.\nI will destroy every remnant of Baal worship in this place,\n    the very names of the idolatrous priests— those who bow down on the roofs\n    to worship the starry host,\nthose who bow down and swear by the Lord\n    and who also swear by Molek, those who turn back from following the Lord\n    and neither seek the Lord nor inquire of him.” Be silent before the Sovereign Lord,\n    for the day of the Lord is near.\nThe Lord has prepared a sacrifice;\n    he has consecrated those he has invited. “On the day of the Lord’s sacrifice\n    I will punish the officials\n    and the king’s sons\nand all those clad\n    in foreign clothes. On that day I will punish\n    all who avoid stepping on the threshold,\nwho fill the temple of their gods\n    with violence and deceit. “On that day,”\n    declares the Lord,\n“a cry will go up from the Fish Gate,\n    wailing from the New Quarter,\n    and a loud crash from the hills. Wail, you who live in the market district;\n    all your merchants will be wiped out,\n    all who trade with silver will be destroyed. At that time I will search Jerusalem with lamps\n    and punish those who are complacent,\n    who are like wine left on its dregs,\nwho think, ‘The Lord will do nothing,\n    either good or bad.’ Their wealth will be plundered,\n    their houses demolished.\nThough they build houses,\n    they will not live in them;\nthough they plant vineyards,\n    they will not drink the wine.” The great day of the Lord is near—\n    near and coming quickly.\nThe cry on the day of the Lord is bitter;\n    the Mighty Warrior shouts his battle cry. That day will be a day of wrath—\n    a day of distress and anguish,\n        a day of trouble and ruin,\n    a day of darkness and gloom,\n        a day of clouds and blackness— a day of trumpet and battle cry\nagainst the fortified cities\n    and against the corner towers. “I will bring such distress on all people\n    that they will grope about like those who are blind,\n    because they have sinned against the Lord.\nTheir blood will be poured out like dust\n    and their entrails like dung. Neither their silver nor their gold\n    will be able to save them\n    on the day of the Lord’s wrath.”\nIn the fire of his jealousy\n    the whole earth will be consumed,\nfor he will make a sudden end\n    of all who live on the earth. \n\nGather together, gather yourselves together,\n    you shameful nation, before the decree takes effect\n    and that day passes like windblown chaff,\nbefore the Lord’s fierce anger\n    comes upon you,\nbefore the day of the Lord’s wrath\n    comes upon you. Seek the Lord, all you humble of the land,\n    you who do what he commands.\nSeek righteousness, seek humility;\n    perhaps you will be sheltered\n    on the day of the Lord’s anger. Gaza will be abandoned\n    and Ashkelon left in ruins.\nAt midday Ashdod will be emptied\n    and Ekron uprooted. Woe to you who live by the sea,\n    you Kerethite people;\nthe word of the Lord is against you,\n    Canaan, land of the Philistines.\nHe says, “I will destroy you,\n    and none will be left.” The land by the sea will become pastures\n    having wells for shepherds\n    and pens for flocks. That land will belong\n    to the remnant of the people of Judah;\n    there they will find pasture.\nIn the evening they will lie down\n    in the houses of Ashkelon.\nThe Lord their God will care for them;\n    he will restore their fortunes. “I have heard the insults of Moab\n    and the taunts of the Ammonites,\nwho insulted my people\n    and made threats against their land. Therefore, as surely as I live,”\n    declares the Lord Almighty,\n    the God of Israel,\n“surely Moab will become like Sodom,\n    the Ammonites like Gomorrah—\na place of weeds and salt pits,\n    a wasteland forever.\nThe remnant of my people will plunder them;\n    the survivors of my nation will inherit their land.” This is what they will get in return for their pride,\n    for insulting and mocking\n    the people of the Lord Almighty. The Lord will be awesome to them\n    when he destroys all the gods of the earth.\nDistant nations will bow down to him,\n    all of them in their own lands. “You Cushites, too,\n    will be slain by my sword.” He will stretch out his hand against the north\n    and destroy Assyria,\nleaving Nineveh utterly desolate\n    and dry as the desert. Flocks and herds will lie down there,\n    creatures of every kind.\nThe desert owl and the screech owl\n    will roost on her columns.\nTheir hooting will echo through the windows,\n    rubble will fill the doorways,\n    the beams of cedar will be exposed. This is the city of revelry\n    that lived in safety.\nShe said to herself,\n    “I am the one! And there is none besides me.”\nWhat a ruin she has become,\n    a lair for wild beasts!\nAll who pass by her scoff\n    and shake their fists. \n\nWoe to the city of oppressors,\n    rebellious and defiled! She obeys no one,\n    she accepts no correction.\nShe does not trust in the Lord,\n    she does not draw near to her God. Her officials within her\n    are roaring lions;\nher rulers are evening wolves,\n    who leave nothing for the morning. Her prophets are unprincipled;\n    they are treacherous people.\nHer priests profane the sanctuary\n    and do violence to the law. The Lord within her is righteous;\n    he does no wrong.\nMorning by morning he dispenses his justice,\n    and every new day he does not fail,\n    yet the unrighteous know no shame. “I have destroyed nations;\n    their strongholds are demolished.\nI have left their streets deserted,\n    with no one passing through.\nTheir cities are laid waste;\n    they are deserted and empty. Of Jerusalem I thought,\n    ‘Surely you will fear me\n    and accept correction!’\nThen her place of refuge would not be destroyed,\n    nor all my punishments come upon her.\nBut they were still eager\n    to act corruptly in all they did. Therefore wait for me,”\n    declares the Lord,\n    “for the day I will stand up to testify.\nI have decided to assemble the nations,\n    to gather the kingdoms\nand to pour out my wrath on them—\n    all my fierce anger.\nThe whole world will be consumed\n    by the fire of my jealous anger. “Then I will purify the lips of the peoples,\n    that all of them may call on the name of the Lord\n    and serve him shoulder to shoulder. From beyond the rivers of Cush\n    my worshipers, my scattered people,\n    will bring me offerings. On that day you, Jerusalem, will not be put to shame\n    for all the wrongs you have done to me,\nbecause I will remove from you\n    your arrogant boasters.\nNever again will you be haughty\n    on my holy hill. But I will leave within you\n    the meek and humble.\nThe remnant of Israel\n    will trust in the name of the Lord. They will do no wrong;\n    they will tell no lies.\nA deceitful tongue\n    will not be found in their mouths.\nThey will eat and lie down\n    and no one will make them afraid.” Sing, Daughter Zion;\n    shout aloud, Israel!\nBe glad and rejoice with all your heart,\n    Daughter Jerusalem! The Lord has taken away your punishment,\n    he has turned back your enemy.\nThe Lord, the King of Israel, is with you;\n    never again will you fear any harm. On that day\n    they will say to Jerusalem,\n“Do not fear, Zion;\n    do not let your hands hang limp. The Lord your God is with you,\n    the Mighty Warrior who saves.\nHe will take great delight in you;\n    in his love he will no longer rebuke you,\n    but will rejoice over you with singing.” “I will remove from you\n    all who mourn over the loss of your appointed festivals,\n    which is a burden and reproach for you. At that time I will deal\n    with all who oppressed you.\nI will rescue the lame;\n    I will gather the exiles.\nI will give them praise and honor\n    in every land where they have suffered shame. At that time I will gather you;\n    at that time I will bring you home.\nI will give you honor and praise\n    among all the peoples of the earth\nwhen I restore your fortunes\n    before your very eyes,”\nsays the Lord. \n\n",
    "offsets": {
        "1": {
            "1": 0,
            "2": 174,
            "3": 256,
            "4": 498,
            "5": 689,
            "6": 827,
            "7": 922,
            "8": 1076,
            "9": 1211,
            "10": 1346,
            "11": 1493,
            "12": 1627,
            "13": 1820,
            "14": 2003,
            "15": 2155,
            "16": 2330,
            "17": 2426,
            "18": 2647
        },
        "2": {
            "1": 2882,
            "2": 2952,
            "3": 3135,
            "4": 3316,
            "5": 3428,
            "6": 3618,
            "7": 3715,
            "8": 3954,
            "9": 4089,
            "10": 4405,
            "11": 4526,
            "12": 4681,
            "13": 4733,
            "14": 4865,
            "15": 5118
        },
        "3": {
            "1": 5354,
            "2": 5413,
            "3": 5533,
            "4": 5651,
            "5": 5781,
            "6": 5961,
            "7": 6157,
            "8": 6393,
            "9": 6681,
            "10": 6820,
            "11": 6920,
            "12": 7129,
            "13": 7244,
            "14": 7419,
            "15": 7530,
            "16": 7689,
            "17": 7790,
            "18": 7981,
            "19": 8110,
            "20": 8305
        }
    }
}