{
    "text": "The beginning of the good news about Jesus the Messiah, the Son of God, as it is written in Isaiah the prophet:\n“I will send my messenger ahead of you,\n    who will prepare your way”— “a voice of one calling in the wilderness,\n‘Prepare the way for the Lord,\n    make straight paths for him.’” And so John the Baptist appeared in the wilderness, preaching a baptism of repentance for the forgiveness of sins. The whole Judean countryside and all the people of Jerusalem went out to him. Confessing their sins, they were baptized by him in the Jordan River. John wore clothing made of camel’s hair, with a leather belt around his waist, and he ate locusts and wild honey. And this was his message: “After me comes the one more powerful than I, the straps of whose sandals I am not worthy to stoop down and untie. I baptize you with water, but he will baptize you with the Holy Spirit.” At that time Jesus came from Nazareth in Galilee and was baptized by John in the Jordan. Just as Jesus was coming up out of the water, he saw heaven being torn open and the Spirit descending on him like a dove. And a voice came from heaven: “You are my Son, whom I love; with you I am well pleased.” At once the Spirit sent him out into the wilderness, and he was in the wilderness forty days, being tempted by Satan. He was with the wild animals, and angels attended him. After John was put in prison, Jesus went into Galilee, proclaiming the good news of God. “The time has come,” he said. “The kingdom of God has come near. Repent and believe the good news!” As Jesus walked beside the Sea of Galilee, he saw Simon and his brother Andrew casting a net into the lake, for they were fishermen. “Come, follow me,” Jesus said, “and I will send you out to fish for people.” At once they left their nets and followed him. When he had gone a little farther, he saw James son of Zebedee and his brother John in a boat, preparing their nets. Without delay he called them, and they left their father Zebedee in the boat with the hired men and followed him. They went to Capernaum, and when the Sabbath came, Jesus went into the synagogue and began to teach. The people were amazed at his teaching, because he taught them as one who had authority, not as the teachers of the law. Just then a man in their synagogue who was possessed by an impure spirit cried out, “What do you want with us, Jesus of Nazareth? Have you come to destroy us? I know who you are—the Holy One of God!” “Be quiet!” said Jesus sternly. “Come out of him!” The impure spirit shook the man violently and came out of him with a shriek. The people were all so amazed that they asked each other, “What is this? A new teaching—and with authority! He even gives orders to impure spirits and they obey him.” News about him spread quickly over the whole region of Galilee. As soon as they left the synagogue, they went with James and John to the home of Simon and Andrew. Simon’s mother-in-law was in bed with a fever, and they immediately told Jesus about her. So he went to her, took her hand and helped her up. The fever left her and she began to wait on them. That evening after sunset the people brought to Jesus all the sick and demon-possessed. The whole town gathered at the door, and Jesus healed many who had various diseases. He also drove out many demons, but he would not let the demons speak because they knew who he was. Very early in the morning, while it was still dark, Jesus got up, left the house and went off to a solitary place, where he prayed. Simon and his companions went to look for him, and when they found him, they exclaimed: “Everyone is looking for you!” Jesus replied, “Let us go somewhere else—to the nearby villages—so I can preach there also. That is why I have come.” So he traveled throughout Galilee, preaching in their synagogues and driving out demons. A man with leprosy came to him and begged him on his knees, “If you are willing, you can make me clean.” Jesus was indignant. He reached out his hand and touched the man. “I am willing,” he said. “Be clean!” Immediately the leprosy left him and he was cleansed. Jesus sent him away at once with a strong warning: “See that you don’t tell this to anyone. But go, show yourself to the priest and offer the sacrifices that Moses commanded for your cleansing, as a testimony to them.” Instead he went out and began to talk freely, spreading the news. As a result, Jesus could no longer enter a town openly but stayed outside in lonely places. Yet the people still came to him from everywhere. \n\nA few days later, when Jesus again entered Capernaum, the people heard that he had come home. They gathered in such large numbers that there was no room left, not even outside the door, and he preached the word to them. Some men came, bringing to him a paralyzed man, carried by four of them. Since they could not get him to Jesus because of the crowd, they made an opening in the roof above Jesus by digging through it and then lowered the mat the man was lying on. When Jesus saw their faith, he said to the paralyzed man, “Son, your sins are forgiven.” Now some teachers of the law were sitting there, thinking to themselves, “Why does this fellow talk like that? He’s blaspheming! Who can forgive sins but God alone?” Immediately Jesus knew in his spirit that this was what they were thinking in their hearts, and he said to them, “Why are you thinking these things? Which is easier: to say to this paralyzed man, ‘Your sins are forgiven,’ or to say, ‘Get up, take your mat and walk’? But I want you to know that the Son of Man has authority on earth to forgive sins.” So he said to the man, “I tell you, get up, take your mat and go home.” He got up, took his mat and walked out in full view of them all. This amazed everyone and they praised God, saying, “We have never seen anything like this!” Once again Jesus went out beside the lake. A large crowd came to him, and he began to teach them. As he walked along, he saw Levi son of Alphaeus sitting at the tax collector’s booth. “Follow me,” Jesus told him, and Levi got up and followed him. While Jesus was having dinner at Levi’s house, many tax collectors and sinners were eating with him and his disciples, for there were many who followed him. When the teachers of the law who were Pharisees saw him eating with the sinners and tax collectors, they asked his disciples: “Why does he eat with tax collectors and sinners?” On hearing this, Jesus said to them, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners.” Now John’s disciples and the Pharisees were fasting. Some people came and asked Jesus, “How is it that John’s disciples and the disciples of the Pharisees are fasting, but yours are not?” Jesus answered, “How can the guests of the bridegroom fast while he is with them? They cannot, so long as they have him with them. But the time will come when the bridegroom will be taken from them, and on that day they will fast. “No one sews a patch of unshrunk cloth on an old garment. Otherwise, the new piece will pull away from the old, making the tear worse. And no one pours new wine into old wineskins. Otherwise, the wine will burst the skins, and both the wine and the wineskins will be ruined. No, they pour new wine into new wineskins.” One Sabbath Jesus was going through the grainfields, and as his disciples walked along, they began to pick some heads of grain. The Pharisees said to him, “Look, why are they doing what is unlawful on the Sabbath?” He answered, “Have you never read what David did when he and his companions were hungry and in need? In the days of Abiathar the high priest, he entered the house of God and ate the consecrated bread, which is lawful only for priests to eat. And he also gave some to his companions.” Then he said to them, “The Sabbath was made for man, not man for the Sabbath. So the Son of Man is Lord even of the Sabbath.” \n\nAnother time Jesus went into the synagogue, and a man with a shriveled hand was there. Some of them were looking for a reason to accuse Jesus, so they watched him closely to see if he would heal him on the Sabbath. Jesus said to the man with the shriveled hand, “Stand up in front of everyone.” Then Jesus asked them, “Which is lawful on the Sabbath: to do good or to do evil, to save life or to kill?” But they remained silent. He looked around at them in anger and, deeply distressed at their stubborn hearts, said to the man, “Stretch out your hand.” He stretched it out, and his hand was completely restored. Then the Pharisees went out and began to plot with the Herodians how they might kill Jesus. Jesus withdrew with his disciples to the lake, and a large crowd from Galilee followed. When they heard about all he was doing, many people came to him from Judea, Jerusalem, Idumea, and the regions across the Jordan and around Tyre and Sidon. Because of the crowd he told his disciples to have a small boat ready for him, to keep the people from crowding him. For he had healed many, so that those with diseases were pushing forward to touch him. Whenever the impure spirits saw him, they fell down before him and cried out, “You are the Son of God.” But he gave them strict orders not to tell others about him. Jesus went up on a mountainside and called to him those he wanted, and they came to him. He appointed twelve that they might be with him and that he might send them out to preach and to have authority to drive out demons. These are the twelve he appointed: Simon (to whom he gave the name Peter), James son of Zebedee and his brother John (to them he gave the name Boanerges, which means “sons of thunder”), Andrew, Philip, Bartholomew, Matthew, Thomas, James son of Alphaeus, Thaddaeus, Simon the Zealot and Judas Iscariot, who betrayed him. Then Jesus entered a house, and again a crowd gathered, so that he and his disciples were not even able to eat. When his family heard about this, they went to take charge of him, for they said, “He is out of his mind.” And the teachers of the law who came down from Jerusalem said, “He is possessed by Beelzebul! By the prince of demons he is driving out demons.” So Jesus called them over to him and began to speak to them in parables: “How can Satan drive out Satan? If a kingdom is divided against itself, that kingdom cannot stand. If a house is divided against itself, that house cannot stand. And if Satan opposes himself and is divided, he cannot stand; his end has come. In fact, no one can enter a strong man’s house without first tying him up. Then he can plunder the strong man’s house. Truly I tell you, people can be forgiven all their sins and every slander they utter, but whoever blasphemes against the Holy Spirit will never be forgiven; they are guilty of an eternal sin.” He said this because they were saying, “He has an impure spirit.” Then Jesus’ mother and brothers arrived. Standing outside, they sent someone in to call him. A crowd was sitting around him, and they told him, “Your mother and brothers are outside looking for you.” “Who are my mother and my brothers?” he asked. Then he looked at those seated in a circle around him and said, “Here are my mother and my brothers! Whoever does God’s will is my brother and sister and mother.” \n\nAgain Jesus began to teach by the lake. The crowd that gathered around him was so large that he got into a boat and sat in it out on the lake, while all the people were along the shore at the water’s edge. He taught them many things by parables, and in his teaching said: “Listen! A farmer went out to sow his seed. As he was scattering the seed, some fell along the path, and the birds came and ate it up. Some fell on rocky places, where it did not have much soil. It sprang up quickly, because the soil was shallow. But when the sun came up, the plants were scorched, and they withered because they had no root. Other seed fell among thorns, which grew up and choked the plants, so that they did not bear grain. Still other seed fell on good soil. It came up, grew and produced a crop, some multiplying thirty, some sixty, some a hundred times.” Then Jesus said, “Whoever has ears to hear, let them hear.” When he was alone, the Twelve and the others around him asked him about the parables. He told them, “The secret of the kingdom of God has been given to you. But to those on the outside everything is said in parables so that,\n“‘they may be ever seeing but never perceiving,\n    and ever hearing but never understanding;\notherwise they might turn and be forgiven!’” Then Jesus said to them, “Don’t you understand this parable? How then will you understand any parable? The farmer sows the word. Some people are like seed along the path, where the word is sown. As soon as they hear it, Satan comes and takes away the word that was sown in them. Others, like seed sown on rocky places, hear the word and at once receive it with joy. But since they have no root, they last only a short time. When trouble or persecution comes because of the word, they quickly fall away. Still others, like seed sown among thorns, hear the word; but the worries of this life, the deceitfulness of wealth and the desires for other things come in and choke the word, making it unfruitful. Others, like seed sown on good soil, hear the word, accept it, and produce a crop—some thirty, some sixty, some a hundred times what was sown.” He said to them, “Do you bring in a lamp to put it under a bowl or a bed? Instead, don’t you put it on its stand? For whatever is hidden is meant to be disclosed, and whatever is concealed is meant to be brought out into the open. If anyone has ears to hear, let them hear.” “Consider carefully what you hear,” he continued. “With the measure you use, it will be measured to you—and even more. Whoever has will be given more; whoever does not have, even what they have will be taken from them.” He also said, “This is what the kingdom of God is like. A man scatters seed on the ground. Night and day, whether he sleeps or gets up, the seed sprouts and grows, though he does not know how. All by itself the soil produces grain—first the stalk, then the head, then the full kernel in the head. As soon as the grain is ripe, he puts the sickle to it, because the harvest has come.” Again he said, “What shall we say the kingdom of God is like, or what parable shall we use to describe it? It is like a mustard seed, which is the smallest of all seeds on earth. Yet when planted, it grows and becomes the largest of all garden plants, with such big branches that the birds can perch in its shade.” With many similar parables Jesus spoke the word to them, as much as they could understand. He did not say anything to them without using a parable. But when he was alone with his own disciples, he explained everything. That day when evening came, he said to his disciples, “Let us go over to the other side.” Leaving the crowd behind, they took him along, just as he was, in the boat. There were also other boats with him. A furious squall came up, and the waves broke over the boat, so that it was nearly swamped. Jesus was in the stern, sleeping on a cushion. The disciples woke him and said to him, “Teacher, don’t you care if we drown?” He got up, rebuked the wind and said to the waves, “Quiet! Be still!” Then the wind died down and it was completely calm. He said to his disciples, “Why are you so afraid? Do you still have no faith?” They were terrified and asked each other, “Who is this? Even the wind and the waves obey him!” \n\nThey went across the lake to the region of the Gerasenes. When Jesus got out of the boat, a man with an impure spirit came from the tombs to meet him. This man lived in the tombs, and no one could bind him anymore, not even with a chain. For he had often been chained hand and foot, but he tore the chains apart and broke the irons on his feet. No one was strong enough to subdue him. Night and day among the tombs and in the hills he would cry out and cut himself with stones. When he saw Jesus from a distance, he ran and fell on his knees in front of him. He shouted at the top of his voice, “What do you want with me, Jesus, Son of the Most High God? In God’s name don’t torture me!” For Jesus had said to him, “Come out of this man, you impure spirit!” Then Jesus asked him, “What is your name?”\n“My name is Legion,” he replied, “for we are many.” And he begged Jesus again and again not to send them out of the area. A large herd of pigs was feeding on the nearby hillside. The demons begged Jesus, “Send us among the pigs; allow us to go into them.” He gave them permission, and the impure spirits came out and went into the pigs. The herd, about two thousand in number, rushed down the steep bank into the lake and were drowned. Those tending the pigs ran off and reported this in the town and countryside, and the people went out to see what had happened. When they came to Jesus, they saw the man who had been possessed by the legion of demons, sitting there, dressed and in his right mind; and they were afraid. Those who had seen it told the people what had happened to the demon-possessed man—and told about the pigs as well. Then the people began to plead with Jesus to leave their region. As Jesus was getting into the boat, the man who had been demon-possessed begged to go with him. Jesus did not let him, but said, “Go home to your own people and tell them how much the Lord has done for you, and how he has had mercy on you.” So the man went away and began to tell in the Decapolis how much Jesus had done for him. And all the people were amazed. When Jesus had again crossed over by boat to the other side of the lake, a large crowd gathered around him while he was by the lake. Then one of the synagogue leaders, named Jairus, came, and when he saw Jesus, he fell at his feet. He pleaded earnestly with him, “My little daughter is dying. Please come and put your hands on her so that she will be healed and live.” So Jesus went with him.\nA large crowd followed and pressed around him. And a woman was there who had been subject to bleeding for twelve years. She had suffered a great deal under the care of many doctors and had spent all she had, yet instead of getting better she grew worse. When she heard about Jesus, she came up behind him in the crowd and touched his cloak, because she thought, “If I just touch his clothes, I will be healed.” Immediately her bleeding stopped and she felt in her body that she was freed from her suffering. At once Jesus realized that power had gone out from him. He turned around in the crowd and asked, “Who touched my clothes?” “You see the people crowding against you,” his disciples answered, “and yet you can ask, ‘Who touched me?’ ” But Jesus kept looking around to see who had done it. Then the woman, knowing what had happened to her, came and fell at his feet and, trembling with fear, told him the whole truth. He said to her, “Daughter, your faith has healed you. Go in peace and be freed from your suffering.” While Jesus was still speaking, some people came from the house of Jairus, the synagogue leader. “Your daughter is dead,” they said. “Why bother the teacher anymore?” Overhearing what they said, Jesus told him, “Don’t be afraid; just believe.” He did not let anyone follow him except Peter, James and John the brother of James. When they came to the home of the synagogue leader, Jesus saw a commotion, with people crying and wailing loudly. He went in and said to them, “Why all this commotion and wailing? The child is not dead but asleep.” But they laughed at him.\nAfter he put them all out, he took the child’s father and mother and the disciples who were with him, and went in where the child was. He took her by the hand and said to her, “Talitha koum!” (which means “Little girl, I say to you, get up!”). Immediately the girl stood up and began to walk around (she was twelve years old). At this they were completely astonished. He gave strict orders not to let anyone know about this, and told them to give her something to eat. \n\nJesus left there and went to his hometown, accompanied by his disciples. When the Sabbath came, he began to teach in the synagogue, and many who heard him were amazed.\n“Where did this man get these things?” they asked. “What’s this wisdom that has been given him? What are these remarkable miracles he is performing? Isn’t this the carpenter? Isn’t this Mary’s son and the brother of James, Joseph, Judas and Simon? Aren’t his sisters here with us?” And they took offense at him. Jesus said to them, “A prophet is not without honor except in his own town, among his relatives and in his own home.” He could not do any miracles there, except lay his hands on a few sick people and heal them. He was amazed at their lack of faith.\nThen Jesus went around teaching from village to village. Calling the Twelve to him, he began to send them out two by two and gave them authority over impure spirits. These were his instructions: “Take nothing for the journey except a staff—no bread, no bag, no money in your belts. Wear sandals but not an extra shirt. Whenever you enter a house, stay there until you leave that town. And if any place will not welcome you or listen to you, leave that place and shake the dust off your feet as a testimony against them.” They went out and preached that people should repent. They drove out many demons and anointed many sick people with oil and healed them. King Herod heard about this, for Jesus’ name had become well known. Some were saying, “John the Baptist has been raised from the dead, and that is why miraculous powers are at work in him.” Others said, “He is Elijah.”\nAnd still others claimed, “He is a prophet, like one of the prophets of long ago.” But when Herod heard this, he said, “John, whom I beheaded, has been raised from the dead!” For Herod himself had given orders to have John arrested, and he had him bound and put in prison. He did this because of Herodias, his brother Philip’s wife, whom he had married. For John had been saying to Herod, “It is not lawful for you to have your brother’s wife.” So Herodias nursed a grudge against John and wanted to kill him. But she was not able to, because Herod feared John and protected him, knowing him to be a righteous and holy man. When Herod heard John, he was greatly puzzled; yet he liked to listen to him. Finally the opportune time came. On his birthday Herod gave a banquet for his high officials and military commanders and the leading men of Galilee. When the daughter of Herodias came in and danced, she pleased Herod and his dinner guests.\nThe king said to the girl, “Ask me for anything you want, and I’ll give it to you.” And he promised her with an oath, “Whatever you ask I will give you, up to half my kingdom.” She went out and said to her mother, “What shall I ask for?”\n“The head of John the Baptist,” she answered. At once the girl hurried in to the king with the request: “I want you to give me right now the head of John the Baptist on a platter.” The king was greatly distressed, but because of his oaths and his dinner guests, he did not want to refuse her. So he immediately sent an executioner with orders to bring John’s head. The man went, beheaded John in the prison, and brought back his head on a platter. He presented it to the girl, and she gave it to her mother. On hearing of this, John’s disciples came and took his body and laid it in a tomb. The apostles gathered around Jesus and reported to him all they had done and taught. Then, because so many people were coming and going that they did not even have a chance to eat, he said to them, “Come with me by yourselves to a quiet place and get some rest.” So they went away by themselves in a boat to a solitary place. But many who saw them leaving recognized them and ran on foot from all the towns and got there ahead of them. When Jesus landed and saw a large crowd, he had compassion on them, because they were like sheep without a shepherd. So he began teaching them many things. By this time it was late in the day, so his disciples came to him. “This is a remote place,” they said, “and it’s already very late. Send the people away so that they can go to the surrounding countryside and villages and buy themselves something to eat.” But he answered, “You give them something to eat.”\nThey said to him, “That would take more than half a year’s wages! Are we to go and spend that much on bread and give it to them to eat?” “How many loaves do you have?” he asked. “Go and see.”\nWhen they found out, they said, “Five—and two fish.” Then Jesus directed them to have all the people sit down in groups on the green grass. So they sat down in groups of hundreds and fifties. Taking the five loaves and the two fish and looking up to heaven, he gave thanks and broke the loaves. Then he gave them to his disciples to distribute to the people. He also divided the two fish among them all. They all ate and were satisfied, and the disciples picked up twelve basketfuls of broken pieces of bread and fish. The number of the men who had eaten was five thousand. Immediately Jesus made his disciples get into the boat and go on ahead of him to Bethsaida, while he dismissed the crowd. After leaving them, he went up on a mountainside to pray. Later that night, the boat was in the middle of the lake, and he was alone on land. He saw the disciples straining at the oars, because the wind was against them. Shortly before dawn he went out to them, walking on the lake. He was about to pass by them, but when they saw him walking on the lake, they thought he was a ghost. They cried out, because they all saw him and were terrified.\nImmediately he spoke to them and said, “Take courage! It is I. Don’t be afraid.” Then he climbed into the boat with them, and the wind died down. They were completely amazed, for they had not understood about the loaves; their hearts were hardened. When they had crossed over, they landed at Gennesaret and anchored there. As soon as they got out of the boat, people recognized Jesus. They ran throughout that whole region and carried the sick on mats to wherever they heard he was. And wherever he went—into villages, towns or countryside—they placed the sick in the marketplaces. They begged him to let them touch even the edge of his cloak, and all who touched it were healed. \n\nThe Pharisees and some of the teachers of the law who had come from Jerusalem gathered around Jesus and saw some of his disciples eating food with hands that were defiled, that is, unwashed. (The Pharisees and all the Jews do not eat unless they give their hands a ceremonial washing, holding to the tradition of the elders. When they come from the marketplace they do not eat unless they wash. And they observe many other traditions, such as the washing of cups, pitchers and kettles.) So the Pharisees and teachers of the law asked Jesus, “Why don’t your disciples live according to the tradition of the elders instead of eating their food with defiled hands?” He replied, “Isaiah was right when he prophesied about you hypocrites; as it is written:\n“‘These people honor me with their lips,\n    but their hearts are far from me. They worship me in vain;\n    their teachings are merely human rules.’ You have let go of the commands of God and are holding on to human traditions.” And he continued, “You have a fine way of setting aside the commands of God in order to observe your own traditions! For Moses said, ‘Honor your father and mother,’ and, ‘Anyone who curses their father or mother is to be put to death.’ But you say that if anyone declares that what might have been used to help their father or mother is Corban (that is, devoted to God)— then you no longer let them do anything for their father or mother. Thus you nullify the word of God by your tradition that you have handed down. And you do many things like that.” Again Jesus called the crowd to him and said, “Listen to me, everyone, and understand this. Nothing outside a person can defile them by going into them. Rather, it is what comes out of a person that defiles them.”  After he had left the crowd and entered the house, his disciples asked him about this parable. “Are you so dull?” he asked. “Don’t you see that nothing that enters a person from the outside can defile them? For it doesn’t go into their heart but into their stomach, and then out of the body.” (In saying this, Jesus declared all foods clean.) He went on: “What comes out of a person is what defiles them. For it is from within, out of a person’s heart, that evil thoughts come—sexual immorality, theft, murder, adultery, greed, malice, deceit, lewdness, envy, slander, arrogance and folly. All these evils come from inside and defile a person.” Jesus left that place and went to the vicinity of Tyre. He entered a house and did not want anyone to know it; yet he could not keep his presence secret. In fact, as soon as she heard about him, a woman whose little daughter was possessed by an impure spirit came and fell at his feet. The woman was a Greek, born in Syrian Phoenicia. She begged Jesus to drive the demon out of her daughter. “First let the children eat all they want,” he told her, “for it is not right to take the children’s bread and toss it to the dogs.” “Lord,” she replied, “even the dogs under the table eat the children’s crumbs.” Then he told her, “For such a reply, you may go; the demon has left your daughter.” She went home and found her child lying on the bed, and the demon gone. Then Jesus left the vicinity of Tyre and went through Sidon, down to the Sea of Galilee and into the region of the Decapolis. There some people brought to him a man who was deaf and could hardly talk, and they begged Jesus to place his hand on him. After he took him aside, away from the crowd, Jesus put his fingers into the man’s ears. Then he spit and touched the man’s tongue. He looked up to heaven and with a deep sigh said to him, “Ephphatha!” (which means “Be opened!”). At this, the man’s ears were opened, his tongue was loosened and he began to speak plainly. Jesus commanded them not to tell anyone. But the more he did so, the more they kept talking about it. People were overwhelmed with amazement. “He has done everything well,” they said. “He even makes the deaf hear and the mute speak.” \n\nDuring those days another large crowd gathered. Since they had nothing to eat, Jesus called his disciples to him and said, “I have compassion for these people; they have already been with me three days and have nothing to eat. If I send them home hungry, they will collapse on the way, because some of them have come a long distance.” His disciples answered, “But where in this remote place can anyone get enough bread to feed them?” “How many loaves do you have?” Jesus asked.\n“Seven,” they replied. He told the crowd to sit down on the ground. When he had taken the seven loaves and given thanks, he broke them and gave them to his disciples to distribute to the people, and they did so. They had a few small fish as well; he gave thanks for them also and told the disciples to distribute them. The people ate and were satisfied. Afterward the disciples picked up seven basketfuls of broken pieces that were left over. About four thousand were present. After he had sent them away, he got into the boat with his disciples and went to the region of Dalmanutha. The Pharisees came and began to question Jesus. To test him, they asked him for a sign from heaven. He sighed deeply and said, “Why does this generation ask for a sign? Truly I tell you, no sign will be given to it.” Then he left them, got back into the boat and crossed to the other side. The disciples had forgotten to bring bread, except for one loaf they had with them in the boat. “Be careful,” Jesus warned them. “Watch out for the yeast of the Pharisees and that of Herod.” They discussed this with one another and said, “It is because we have no bread.” Aware of their discussion, Jesus asked them: “Why are you talking about having no bread? Do you still not see or understand? Are your hearts hardened? Do you have eyes but fail to see, and ears but fail to hear? And don’t you remember? When I broke the five loaves for the five thousand, how many basketfuls of pieces did you pick up?”\n“Twelve,” they replied. “And when I broke the seven loaves for the four thousand, how many basketfuls of pieces did you pick up?”\nThey answered, “Seven.” He said to them, “Do you still not understand?” They came to Bethsaida, and some people brought a blind man and begged Jesus to touch him. He took the blind man by the hand and led him outside the village. When he had spit on the man’s eyes and put his hands on him, Jesus asked, “Do you see anything?” He looked up and said, “I see people; they look like trees walking around.” Once more Jesus put his hands on the man’s eyes. Then his eyes were opened, his sight was restored, and he saw everything clearly. Jesus sent him home, saying, “Don’t even go into the village.” Jesus and his disciples went on to the villages around Caesarea Philippi. On the way he asked them, “Who do people say I am?” They replied, “Some say John the Baptist; others say Elijah; and still others, one of the prophets.” “But what about you?” he asked. “Who do you say I am?”\nPeter answered, “You are the Messiah.” Jesus warned them not to tell anyone about him. He then began to teach them that the Son of Man must suffer many things and be rejected by the elders, the chief priests and the teachers of the law, and that he must be killed and after three days rise again. He spoke plainly about this, and Peter took him aside and began to rebuke him. But when Jesus turned and looked at his disciples, he rebuked Peter. “Get behind me, Satan!” he said. “You do not have in mind the concerns of God, but merely human concerns.” Then he called the crowd to him along with his disciples and said: “Whoever wants to be my disciple must deny themselves and take up their cross and follow me. For whoever wants to save their life will lose it, but whoever loses their life for me and for the gospel will save it. What good is it for someone to gain the whole world, yet forfeit their soul? Or what can anyone give in exchange for their soul? If anyone is ashamed of me and my words in this adulterous and sinful generation, the Son of Man will be ashamed of them when he comes in his Father’s glory with the holy angels.” \n\nAnd he said to them, “Truly I tell you, some who are standing here will not taste death before they see that the kingdom of God has come with power.” After six days Jesus took Peter, James and John with him and led them up a high mountain, where they were all alone. There he was transfigured before them. His clothes became dazzling white, whiter than anyone in the world could bleach them. And there appeared before them Elijah and Moses, who were talking with Jesus. Peter said to Jesus, “Rabbi, it is good for us to be here. Let us put up three shelters—one for you, one for Moses and one for Elijah.” (He did not know what to say, they were so frightened.) Then a cloud appeared and covered them, and a voice came from the cloud: “This is my Son, whom I love. Listen to him!” Suddenly, when they looked around, they no longer saw anyone with them except Jesus. As they were coming down the mountain, Jesus gave them orders not to tell anyone what they had seen until the Son of Man had risen from the dead. They kept the matter to themselves, discussing what “rising from the dead” meant. And they asked him, “Why do the teachers of the law say that Elijah must come first?” Jesus replied, “To be sure, Elijah does come first, and restores all things. Why then is it written that the Son of Man must suffer much and be rejected? But I tell you, Elijah has come, and they have done to him everything they wished, just as it is written about him.” When they came to the other disciples, they saw a large crowd around them and the teachers of the law arguing with them. As soon as all the people saw Jesus, they were overwhelmed with wonder and ran to greet him. “What are you arguing with them about?” he asked. A man in the crowd answered, “Teacher, I brought you my son, who is possessed by a spirit that has robbed him of speech. Whenever it seizes him, it throws him to the ground. He foams at the mouth, gnashes his teeth and becomes rigid. I asked your disciples to drive out the spirit, but they could not.” “You unbelieving generation,” Jesus replied, “how long shall I stay with you? How long shall I put up with you? Bring the boy to me.” So they brought him. When the spirit saw Jesus, it immediately threw the boy into a convulsion. He fell to the ground and rolled around, foaming at the mouth. Jesus asked the boy’s father, “How long has he been like this?”\n“From childhood,” he answered. “It has often thrown him into fire or water to kill him. But if you can do anything, take pity on us and help us.” “‘If you can’?” said Jesus. “Everything is possible for one who believes.” Immediately the boy’s father exclaimed, “I do believe; help me overcome my unbelief!” When Jesus saw that a crowd was running to the scene, he rebuked the impure spirit. “You deaf and mute spirit,” he said, “I command you, come out of him and never enter him again.” The spirit shrieked, convulsed him violently and came out. The boy looked so much like a corpse that many said, “He’s dead.” But Jesus took him by the hand and lifted him to his feet, and he stood up. After Jesus had gone indoors, his disciples asked him privately, “Why couldn’t we drive it out?” He replied, “This kind can come out only by prayer.” They left that place and passed through Galilee. Jesus did not want anyone to know where they were, because he was teaching his disciples. He said to them, “The Son of Man is going to be delivered into the hands of men. They will kill him, and after three days he will rise.” But they did not understand what he meant and were afraid to ask him about it. They came to Capernaum. When he was in the house, he asked them, “What were you arguing about on the road?” But they kept quiet because on the way they had argued about who was the greatest. Sitting down, Jesus called the Twelve and said, “Anyone who wants to be first must be the very last, and the servant of all.” He took a little child whom he placed among them. Taking the child in his arms, he said to them, “Whoever welcomes one of these little children in my name welcomes me; and whoever welcomes me does not welcome me but the one who sent me.” “Teacher,” said John, “we saw someone driving out demons in your name and we told him to stop, because he was not one of us.” “Do not stop him,” Jesus said. “For no one who does a miracle in my name can in the next moment say anything bad about me, for whoever is not against us is for us. Truly I tell you, anyone who gives you a cup of water in my name because you belong to the Messiah will certainly not lose their reward. “If anyone causes one of these little ones—those who believe in me—to stumble, it would be better for them if a large millstone were hung around their neck and they were thrown into the sea. If your hand causes you to stumble, cut it off. It is better for you to enter life maimed than with two hands to go into hell, where the fire never goes out.  And if your foot causes you to stumble, cut it off. It is better for you to enter life crippled than to have two feet and be thrown into hell.  And if your eye causes you to stumble, pluck it out. It is better for you to enter the kingdom of God with one eye than to have two eyes and be thrown into hell, where\n“‘the worms that eat them do not die,\n    and the fire is not quenched.’ Everyone will be salted with fire. “Salt is good, but if it loses its saltiness, how can you make it salty again? Have salt among yourselves, and be at peace with each other.” \n\nJesus then left that place and went into the region of Judea and across the Jordan. Again crowds of people came to him, and as was his custom, he taught them. Some Pharisees came and tested him by asking, “Is it lawful for a man to divorce his wife?” “What did Moses command you?” he replied. They said, “Moses permitted a man to write a certificate of divorce and send her away.” “It was because your hearts were hard that Moses wrote you this law,” Jesus replied. “But at the beginning of creation God ‘made them male and female.’ ‘For this reason a man will leave his father and mother and be united to his wife, and the two will become one flesh.’ So they are no longer two, but one flesh. Therefore what God has joined together, let no one separate.” When they were in the house again, the disciples asked Jesus about this. He answered, “Anyone who divorces his wife and marries another woman commits adultery against her. And if she divorces her husband and marries another man, she commits adultery.” People were bringing little children to Jesus for him to place his hands on them, but the disciples rebuked them. When Jesus saw this, he was indignant. He said to them, “Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these. Truly I tell you, anyone who will not receive the kingdom of God like a little child will never enter it.” And he took the children in his arms, placed his hands on them and blessed them. As Jesus started on his way, a man ran up to him and fell on his knees before him. “Good teacher,” he asked, “what must I do to inherit eternal life?” “Why do you call me good?” Jesus answered. “No one is good—except God alone. You know the commandments: ‘You shall not murder, you shall not commit adultery, you shall not steal, you shall not give false testimony, you shall not defraud, honor your father and mother.’” “Teacher,” he declared, “all these I have kept since I was a boy.” Jesus looked at him and loved him. “One thing you lack,” he said. “Go, sell everything you have and give to the poor, and you will have treasure in heaven. Then come, follow me.” At this the man’s face fell. He went away sad, because he had great wealth. Jesus looked around and said to his disciples, “How hard it is for the rich to enter the kingdom of God!” The disciples were amazed at his words. But Jesus said again, “Children, how hard it is to enter the kingdom of God! It is easier for a camel to go through the eye of a needle than for someone who is rich to enter the kingdom of God.” The disciples were even more amazed, and said to each other, “Who then can be saved?” Jesus looked at them and said, “With man this is impossible, but not with God; all things are possible with God.” Then Peter spoke up, “We have left everything to follow you!” “Truly I tell you,” Jesus replied, “no one who has left home or brothers or sisters or mother or father or children or fields for me and the gospel will fail to receive a hundred times as much in this present age: homes, brothers, sisters, mothers, children and fields—along with persecutions—and in the age to come eternal life. But many who are first will be last, and the last first.” They were on their way up to Jerusalem, with Jesus leading the way, and the disciples were astonished, while those who followed were afraid. Again he took the Twelve aside and told them what was going to happen to him. “We are going up to Jerusalem,” he said, “and the Son of Man will be delivered over to the chief priests and the teachers of the law. They will condemn him to death and will hand him over to the Gentiles, who will mock him and spit on him, flog him and kill him. Three days later he will rise.” Then James and John, the sons of Zebedee, came to him. “Teacher,” they said, “we want you to do for us whatever we ask.” “What do you want me to do for you?” he asked. They replied, “Let one of us sit at your right and the other at your left in your glory.” “You don’t know what you are asking,” Jesus said. “Can you drink the cup I drink or be baptized with the baptism I am baptized with?” “We can,” they answered.\nJesus said to them, “You will drink the cup I drink and be baptized with the baptism I am baptized with, but to sit at my right or left is not for me to grant. These places belong to those for whom they have been prepared.” When the ten heard about this, they became indignant with James and John. Jesus called them together and said, “You know that those who are regarded as rulers of the Gentiles lord it over them, and their high officials exercise authority over them. Not so with you. Instead, whoever wants to become great among you must be your servant, and whoever wants to be first must be slave of all. For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many.” Then they came to Jericho. As Jesus and his disciples, together with a large crowd, were leaving the city, a blind man, Bartimaeus (which means “son of Timaeus”), was sitting by the roadside begging. When he heard that it was Jesus of Nazareth, he began to shout, “Jesus, Son of David, have mercy on me!” Many rebuked him and told him to be quiet, but he shouted all the more, “Son of David, have mercy on me!” Jesus stopped and said, “Call him.”\nSo they called to the blind man, “Cheer up! On your feet! He’s calling you.” Throwing his cloak aside, he jumped to his feet and came to Jesus. “What do you want me to do for you?” Jesus asked him.\nThe blind man said, “Rabbi, I want to see.” “Go,” said Jesus, “your faith has healed you.” Immediately he received his sight and followed Jesus along the road. \n\nAs they approached Jerusalem and came to Bethphage and Bethany at the Mount of Olives, Jesus sent two of his disciples, saying to them, “Go to the village ahead of you, and just as you enter it, you will find a colt tied there, which no one has ever ridden. Untie it and bring it here. If anyone asks you, ‘Why are you doing this?’ say, ‘The Lord needs it and will send it back here shortly.’” They went and found a colt outside in the street, tied at a doorway. As they untied it, some people standing there asked, “What are you doing, untying that colt?” They answered as Jesus had told them to, and the people let them go. When they brought the colt to Jesus and threw their cloaks over it, he sat on it. Many people spread their cloaks on the road, while others spread branches they had cut in the fields. Those who went ahead and those who followed shouted,\n“Hosanna!”\n“Blessed is he who comes in the name of the Lord!” “Blessed is the coming kingdom of our father David!”\n“Hosanna in the highest heaven!” Jesus entered Jerusalem and went into the temple courts. He looked around at everything, but since it was already late, he went out to Bethany with the Twelve. The next day as they were leaving Bethany, Jesus was hungry. Seeing in the distance a fig tree in leaf, he went to find out if it had any fruit. When he reached it, he found nothing but leaves, because it was not the season for figs. Then he said to the tree, “May no one ever eat fruit from you again.” And his disciples heard him say it. On reaching Jerusalem, Jesus entered the temple courts and began driving out those who were buying and selling there. He overturned the tables of the money changers and the benches of those selling doves, and would not allow anyone to carry merchandise through the temple courts. And as he taught them, he said, “Is it not written: ‘My house will be called a house of prayer for all nations’? But you have made it ‘a den of robbers.’” The chief priests and the teachers of the law heard this and began looking for a way to kill him, for they feared him, because the whole crowd was amazed at his teaching. When evening came, Jesus and his disciples went out of the city. In the morning, as they went along, they saw the fig tree withered from the roots. Peter remembered and said to Jesus, “Rabbi, look! The fig tree you cursed has withered!” “Have faith in God,” Jesus answered. “Truly I tell you, if anyone says to this mountain, ‘Go, throw yourself into the sea,’ and does not doubt in their heart but believes that what they say will happen, it will be done for them. Therefore I tell you, whatever you ask for in prayer, believe that you have received it, and it will be yours. And when you stand praying, if you hold anything against anyone, forgive them, so that your Father in heaven may forgive you your sins.”  They arrived again in Jerusalem, and while Jesus was walking in the temple courts, the chief priests, the teachers of the law and the elders came to him. “By what authority are you doing these things?” they asked. “And who gave you authority to do this?” Jesus replied, “I will ask you one question. Answer me, and I will tell you by what authority I am doing these things. John’s baptism—was it from heaven, or of human origin? Tell me!” They discussed it among themselves and said, “If we say, ‘From heaven,’ he will ask, ‘Then why didn’t you believe him?’ But if we say, ‘Of human origin’ …” (They feared the people, for everyone held that John really was a prophet.) So they answered Jesus, “We don’t know.”\nJesus said, “Neither will I tell you by what authority I am doing these things.” \n\nJesus then began to speak to them in parables: “A man planted a vineyard. He put a wall around it, dug a pit for the winepress and built a watchtower. Then he rented the vineyard to some farmers and moved to another place. At harvest time he sent a servant to the tenants to collect from them some of the fruit of the vineyard. But they seized him, beat him and sent him away empty-handed. Then he sent another servant to them; they struck this man on the head and treated him shamefully. He sent still another, and that one they killed. He sent many others; some of them they beat, others they killed. “He had one left to send, a son, whom he loved. He sent him last of all, saying, ‘They will respect my son.’ “But the tenants said to one another, ‘This is the heir. Come, let’s kill him, and the inheritance will be ours.’ So they took him and killed him, and threw him out of the vineyard. “What then will the owner of the vineyard do? He will come and kill those tenants and give the vineyard to others. Haven’t you read this passage of Scripture:\n“‘The stone the builders rejected\n    has become the cornerstone; the Lord has done this,\n    and it is marvelous in our eyes’?” Then the chief priests, the teachers of the law and the elders looked for a way to arrest him because they knew he had spoken the parable against them. But they were afraid of the crowd; so they left him and went away. Later they sent some of the Pharisees and Herodians to Jesus to catch him in his words. They came to him and said, “Teacher, we know that you are a man of integrity. You aren’t swayed by others, because you pay no attention to who they are; but you teach the way of God in accordance with the truth. Is it right to pay the imperial tax to Caesar or not? Should we pay or shouldn’t we?”\nBut Jesus knew their hypocrisy. “Why are you trying to trap me?” he asked. “Bring me a denarius and let me look at it.” They brought the coin, and he asked them, “Whose image is this? And whose inscription?”\n“Caesar’s,” they replied. Then Jesus said to them, “Give back to Caesar what is Caesar’s and to God what is God’s.”\nAnd they were amazed at him. Then the Sadducees, who say there is no resurrection, came to him with a question. “Teacher,” they said, “Moses wrote for us that if a man’s brother dies and leaves a wife but no children, the man must marry the widow and raise up offspring for his brother. Now there were seven brothers. The first one married and died without leaving any children. The second one married the widow, but he also died, leaving no child. It was the same with the third. In fact, none of the seven left any children. Last of all, the woman died too. At the resurrection whose wife will she be, since the seven were married to her?” Jesus replied, “Are you not in error because you do not know the Scriptures or the power of God? When the dead rise, they will neither marry nor be given in marriage; they will be like the angels in heaven. Now about the dead rising—have you not read in the Book of Moses, in the account of the burning bush, how God said to him, ‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living. You are badly mistaken!” One of the teachers of the law came and heard them debating. Noticing that Jesus had given them a good answer, he asked him, “Of all the commandments, which is the most important?” “The most important one,” answered Jesus, “is this: ‘Hear, O Israel: The Lord our God, the Lord is one. Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’ The second is this: ‘Love your neighbor as yourself.’ There is no commandment greater than these.” “Well said, teacher,” the man replied. “You are right in saying that God is one and there is no other but him. To love him with all your heart, with all your understanding and with all your strength, and to love your neighbor as yourself is more important than all burnt offerings and sacrifices.” When Jesus saw that he had answered wisely, he said to him, “You are not far from the kingdom of God.” And from then on no one dared ask him any more questions. While Jesus was teaching in the temple courts, he asked, “Why do the teachers of the law say that the Messiah is the son of David? David himself, speaking by the Holy Spirit, declared:\n“‘The Lord said to my Lord:\n    “Sit at my right hand\nuntil I put your enemies\n    under your feet.”’ David himself calls him ‘Lord.’ How then can he be his son?”\nThe large crowd listened to him with delight. As he taught, Jesus said, “Watch out for the teachers of the law. They like to walk around in flowing robes and be greeted with respect in the marketplaces, and have the most important seats in the synagogues and the places of honor at banquets. They devour widows’ houses and for a show make lengthy prayers. These men will be punished most severely.” Jesus sat down opposite the place where the offerings were put and watched the crowd putting their money into the temple treasury. Many rich people threw in large amounts. But a poor widow came and put in two very small copper coins, worth only a few cents. Calling his disciples to him, Jesus said, “Truly I tell you, this poor widow has put more into the treasury than all the others. They all gave out of their wealth; but she, out of her poverty, put in everything—all she had to live on.” \n\nAs Jesus was leaving the temple, one of his disciples said to him, “Look, Teacher! What massive stones! What magnificent buildings!” “Do you see all these great buildings?” replied Jesus. “Not one stone here will be left on another; every one will be thrown down.” As Jesus was sitting on the Mount of Olives opposite the temple, Peter, James, John and Andrew asked him privately, “Tell us, when will these things happen? And what will be the sign that they are all about to be fulfilled?” Jesus said to them: “Watch out that no one deceives you. Many will come in my name, claiming, ‘I am he,’ and will deceive many. When you hear of wars and rumors of wars, do not be alarmed. Such things must happen, but the end is still to come. Nation will rise against nation, and kingdom against kingdom. There will be earthquakes in various places, and famines. These are the beginning of birth pains. “You must be on your guard. You will be handed over to the local councils and flogged in the synagogues. On account of me you will stand before governors and kings as witnesses to them. And the gospel must first be preached to all nations. Whenever you are arrested and brought to trial, do not worry beforehand about what to say. Just say whatever is given you at the time, for it is not you speaking, but the Holy Spirit. “Brother will betray brother to death, and a father his child. Children will rebel against their parents and have them put to death. Everyone will hate you because of me, but the one who stands firm to the end will be saved. “When you see ‘the abomination that causes desolation’ standing where it does not belong—let the reader understand—then let those who are in Judea flee to the mountains. Let no one on the housetop go down or enter the house to take anything out. Let no one in the field go back to get their cloak. How dreadful it will be in those days for pregnant women and nursing mothers! Pray that this will not take place in winter, because those will be days of distress unequaled from the beginning, when God created the world, until now—and never to be equaled again. “If the Lord had not cut short those days, no one would survive. But for the sake of the elect, whom he has chosen, he has shortened them. At that time if anyone says to you, ‘Look, here is the Messiah!’ or, ‘Look, there he is!’ do not believe it. For false messiahs and false prophets will appear and perform signs and wonders to deceive, if possible, even the elect. So be on your guard; I have told you everything ahead of time. “But in those days, following that distress,\n“‘the sun will be darkened,\n    and the moon will not give its light; the stars will fall from the sky,\n    and the heavenly bodies will be shaken.’ “At that time people will see the Son of Man coming in clouds with great power and glory. And he will send his angels and gather his elect from the four winds, from the ends of the earth to the ends of the heavens. “Now learn this lesson from the fig tree: As soon as its twigs get tender and its leaves come out, you know that summer is near. Even so, when you see these things happening, you know that it is near, right at the door. Truly I tell you, this generation will certainly not pass away until all these things have happened. Heaven and earth will pass away, but my words will never pass away. “But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father. Be on guard! Be alert! You do not know when that time will come. It’s like a man going away: He leaves his house and puts his servants in charge, each with their assigned task, and tells the one at the door to keep watch. “Therefore keep watch because you do not know when the owner of the house will come back—whether in the evening, or at midnight, or when the rooster crows, or at dawn. If he comes suddenly, do not let him find you sleeping. What I say to you, I say to everyone: ‘Watch!’” \n\nNow the Passover and the Festival of Unleavened Bread were only two days away, and the chief priests and the teachers of the law were scheming to arrest Jesus secretly and kill him. “But not during the festival,” they said, “or the people may riot.” While he was in Bethany, reclining at the table in the home of Simon the Leper, a woman came with an alabaster jar of very expensive perfume, made of pure nard. She broke the jar and poured the perfume on his head. Some of those present were saying indignantly to one another, “Why this waste of perfume? It could have been sold for more than a year’s wages and the money given to the poor.” And they rebuked her harshly. “Leave her alone,” said Jesus. “Why are you bothering her? She has done a beautiful thing to me. The poor you will always have with you, and you can help them any time you want. But you will not always have me. She did what she could. She poured perfume on my body beforehand to prepare for my burial. Truly I tell you, wherever the gospel is preached throughout the world, what she has done will also be told, in memory of her.” Then Judas Iscariot, one of the Twelve, went to the chief priests to betray Jesus to them. They were delighted to hear this and promised to give him money. So he watched for an opportunity to hand him over. On the first day of the Festival of Unleavened Bread, when it was customary to sacrifice the Passover lamb, Jesus’ disciples asked him, “Where do you want us to go and make preparations for you to eat the Passover?” So he sent two of his disciples, telling them, “Go into the city, and a man carrying a jar of water will meet you. Follow him. Say to the owner of the house he enters, ‘The Teacher asks: Where is my guest room, where I may eat the Passover with my disciples?’ He will show you a large room upstairs, furnished and ready. Make preparations for us there.” The disciples left, went into the city and found things just as Jesus had told them. So they prepared the Passover. When evening came, Jesus arrived with the Twelve. While they were reclining at the table eating, he said, “Truly I tell you, one of you will betray me—one who is eating with me.” They were saddened, and one by one they said to him, “Surely you don’t mean me?” “It is one of the Twelve,” he replied, “one who dips bread into the bowl with me. The Son of Man will go just as it is written about him. But woe to that man who betrays the Son of Man! It would be better for him if he had not been born.” While they were eating, Jesus took bread, and when he had given thanks, he broke it and gave it to his disciples, saying, “Take it; this is my body.” Then he took a cup, and when he had given thanks, he gave it to them, and they all drank from it. “This is my blood of the covenant, which is poured out for many,” he said to them. “Truly I tell you, I will not drink again from the fruit of the vine until that day when I drink it new in the kingdom of God.” When they had sung a hymn, they went out to the Mount of Olives. “You will all fall away,” Jesus told them, “for it is written:\n“‘I will strike the shepherd,\n    and the sheep will be scattered.’ But after I have risen, I will go ahead of you into Galilee.” Peter declared, “Even if all fall away, I will not.” “Truly I tell you,” Jesus answered, “today—yes, tonight—before the rooster crows twice you yourself will disown me three times.” But Peter insisted emphatically, “Even if I have to die with you, I will never disown you.” And all the others said the same. They went to a place called Gethsemane, and Jesus said to his disciples, “Sit here while I pray.” He took Peter, James and John along with him, and he began to be deeply distressed and troubled. “My soul is overwhelmed with sorrow to the point of death,” he said to them. “Stay here and keep watch.” Going a little farther, he fell to the ground and prayed that if possible the hour might pass from him. “Abba, Father,” he said, “everything is possible for you. Take this cup from me. Yet not what I will, but what you will.” Then he returned to his disciples and found them sleeping. “Simon,” he said to Peter, “are you asleep? Couldn’t you keep watch for one hour? Watch and pray so that you will not fall into temptation. The spirit is willing, but the flesh is weak.” Once more he went away and prayed the same thing. When he came back, he again found them sleeping, because their eyes were heavy. They did not know what to say to him. Returning the third time, he said to them, “Are you still sleeping and resting? Enough! The hour has come. Look, the Son of Man is delivered into the hands of sinners. Rise! Let us go! Here comes my betrayer!” Just as he was speaking, Judas, one of the Twelve, appeared. With him was a crowd armed with swords and clubs, sent from the chief priests, the teachers of the law, and the elders. Now the betrayer had arranged a signal with them: “The one I kiss is the man; arrest him and lead him away under guard.” Going at once to Jesus, Judas said, “Rabbi!” and kissed him. The men seized Jesus and arrested him. Then one of those standing near drew his sword and struck the servant of the high priest, cutting off his ear. “Am I leading a rebellion,” said Jesus, “that you have come out with swords and clubs to capture me? Every day I was with you, teaching in the temple courts, and you did not arrest me. But the Scriptures must be fulfilled.” Then everyone deserted him and fled. A young man, wearing nothing but a linen garment, was following Jesus. When they seized him, he fled naked, leaving his garment behind. They took Jesus to the high priest, and all the chief priests, the elders and the teachers of the law came together. Peter followed him at a distance, right into the courtyard of the high priest. There he sat with the guards and warmed himself at the fire. The chief priests and the whole Sanhedrin were looking for evidence against Jesus so that they could put him to death, but they did not find any. Many testified falsely against him, but their statements did not agree. Then some stood up and gave this false testimony against him: “We heard him say, ‘I will destroy this temple made with human hands and in three days will build another, not made with hands.’” Yet even then their testimony did not agree. Then the high priest stood up before them and asked Jesus, “Are you not going to answer? What is this testimony that these men are bringing against you?” But Jesus remained silent and gave no answer.\nAgain the high priest asked him, “Are you the Messiah, the Son of the Blessed One?” “I am,” said Jesus. “And you will see the Son of Man sitting at the right hand of the Mighty One and coming on the clouds of heaven.” The high priest tore his clothes. “Why do we need any more witnesses?” he asked. “You have heard the blasphemy. What do you think?”\nThey all condemned him as worthy of death. Then some began to spit at him; they blindfolded him, struck him with their fists, and said, “Prophesy!” And the guards took him and beat him. While Peter was below in the courtyard, one of the servant girls of the high priest came by. When she saw Peter warming himself, she looked closely at him.\n“You also were with that Nazarene, Jesus,” she said. But he denied it. “I don’t know or understand what you’re talking about,” he said, and went out into the entryway. When the servant girl saw him there, she said again to those standing around, “This fellow is one of them.” Again he denied it.\nAfter a little while, those standing near said to Peter, “Surely you are one of them, for you are a Galilean.” He began to call down curses, and he swore to them, “I don’t know this man you’re talking about.” Immediately the rooster crowed the second time. Then Peter remembered the word Jesus had spoken to him: “Before the rooster crows twice you will disown me three times.” And he broke down and wept. \n\nVery early in the morning, the chief priests, with the elders, the teachers of the law and the whole Sanhedrin, made their plans. So they bound Jesus, led him away and handed him over to Pilate. “Are you the king of the Jews?” asked Pilate.\n“You have said so,” Jesus replied. The chief priests accused him of many things. So again Pilate asked him, “Aren’t you going to answer? See how many things they are accusing you of.” But Jesus still made no reply, and Pilate was amazed. Now it was the custom at the festival to release a prisoner whom the people requested. A man called Barabbas was in prison with the insurrectionists who had committed murder in the uprising. The crowd came up and asked Pilate to do for them what he usually did. “Do you want me to release to you the king of the Jews?” asked Pilate, knowing it was out of self-interest that the chief priests had handed Jesus over to him. But the chief priests stirred up the crowd to have Pilate release Barabbas instead. “What shall I do, then, with the one you call the king of the Jews?” Pilate asked them. “Crucify him!” they shouted. “Why? What crime has he committed?” asked Pilate.\nBut they shouted all the louder, “Crucify him!” Wanting to satisfy the crowd, Pilate released Barabbas to them. He had Jesus flogged, and handed him over to be crucified. The soldiers led Jesus away into the palace (that is, the Praetorium) and called together the whole company of soldiers. They put a purple robe on him, then twisted together a crown of thorns and set it on him. And they began to call out to him, “Hail, king of the Jews!” Again and again they struck him on the head with a staff and spit on him. Falling on their knees, they paid homage to him. And when they had mocked him, they took off the purple robe and put his own clothes on him. Then they led him out to crucify him. A certain man from Cyrene, Simon, the father of Alexander and Rufus, was passing by on his way in from the country, and they forced him to carry the cross. They brought Jesus to the place called Golgotha (which means “the place of the skull”). Then they offered him wine mixed with myrrh, but he did not take it. And they crucified him. Dividing up his clothes, they cast lots to see what each would get. It was nine in the morning when they crucified him. The written notice of the charge against him read: the king of the jews. They crucified two rebels with him, one on his right and one on his left.  Those who passed by hurled insults at him, shaking their heads and saying, “So! You who are going to destroy the temple and build it in three days, come down from the cross and save yourself!” In the same way the chief priests and the teachers of the law mocked him among themselves. “He saved others,” they said, “but he can’t save himself! Let this Messiah, this king of Israel, come down now from the cross, that we may see and believe.” Those crucified with him also heaped insults on him. At noon, darkness came over the whole land until three in the afternoon. And at three in the afternoon Jesus cried out in a loud voice, “Eloi, Eloi, lema sabachthani?” (which means “My God, my God, why have you forsaken me?”). When some of those standing near heard this, they said, “Listen, he’s calling Elijah.” Someone ran, filled a sponge with wine vinegar, put it on a staff, and offered it to Jesus to drink. “Now leave him alone. Let’s see if Elijah comes to take him down,” he said. With a loud cry, Jesus breathed his last. The curtain of the temple was torn in two from top to bottom. And when the centurion, who stood there in front of Jesus, saw how he died, he said, “Surely this man was the Son of God!” Some women were watching from a distance. Among them were Mary Magdalene, Mary the mother of James the younger and of Joseph, and Salome. In Galilee these women had followed him and cared for his needs. Many other women who had come up with him to Jerusalem were also there. It was Preparation Day (that is, the day before the Sabbath). So as evening approached, Joseph of Arimathea, a prominent member of the Council, who was himself waiting for the kingdom of God, went boldly to Pilate and asked for Jesus’ body. Pilate was surprised to hear that he was already dead. Summoning the centurion, he asked him if Jesus had already died. When he learned from the centurion that it was so, he gave the body to Joseph. So Joseph bought some linen cloth, took down the body, wrapped it in the linen, and placed it in a tomb cut out of rock. Then he rolled a stone against the entrance of the tomb. Mary Magdalene and Mary the mother of Joseph saw where he was laid. \n\nWhen the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices so that they might go to anoint Jesus’ body. Very early on the first day of the week, just after sunrise, they were on their way to the tomb and they asked each other, “Who will roll the stone away from the entrance of the tomb?” But when they looked up, they saw that the stone, which was very large, had been rolled away. As they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed. “Don’t be alarmed,” he said. “You are looking for Jesus the Nazarene, who was crucified. He has risen! He is not here. See the place where they laid him. But go, tell his disciples and Peter, ‘He is going ahead of you into Galilee. There you will see him, just as he told you.’” Trembling and bewildered, the women went out and fled from the tomb. They said nothing to anyone, because they were afraid. When Jesus rose early on the first day of the week, he appeared first to Mary Magdalene, out of whom he had driven seven demons. She went and told those who had been with him and who were mourning and weeping. When they heard that Jesus was alive and that she had seen him, they did not believe it. Afterward Jesus appeared in a different form to two of them while they were walking in the country. These returned and reported it to the rest; but they did not believe them either. Later Jesus appeared to the Eleven as they were eating; he rebuked them for their lack of faith and their stubborn refusal to believe those who had seen him after he had risen. He said to them, “Go into all the world and preach the gospel to all creation. Whoever believes and is baptized will be saved, but whoever does not believe will be condemned. And these signs will accompany those who believe: In my name they will drive out demons; they will speak in new tongues; they will pick up snakes with their hands; and when they drink deadly poison, it will not hurt them at all; they will place their hands on sick people, and they will get well.” After the Lord Jesus had spoken to them, he was taken up into heaven and he sat at the right hand of God. Then the disciples went out and preached everywhere, and the Lord worked with them and confirmed his word by the signs that accompanied it. \n\n",
    "offsets": {
        "1": {
            "1": 0,
            "2": 72,
            "3": 184,
            "4": 293,
            "5": 408,
            "6": 556,
            "7": 670,
            "8": 811,
            "9": 884,
            "10": 973,
            "11": 1095,
            "12": 1184,
            "13": 1237,
            "14": 1357,
            "15": 1446,
            "16": 1546,
            "17": 1679,
            "18": 1756,
            "19": 1803,
            "20": 1920,
            "21": 2034,
            "22": 2135,
            "23": 2256,
            "24": 2340,
            "25": 2456,
            "26": 2507,
            "27": 2584,
            "28": 2751,
            "29": 2815,
            "30": 2914,
            "31": 3004,
            "32": 3106,
            "33": 3194,
            "34": 3231,
            "35": 3378,
            "36": 3510,
            "37": 3557,
            "38": 3629,
            "39": 3747,
            "40": 3836,
            "41": 3941,
            "42": 4044,
            "43": 4098,
            "44": 4149,
            "45": 4317
        },
        "2": {
            "1": 4527,
            "2": 4621,
            "3": 4747,
            "4": 4820,
            "5": 4994,
            "6": 5083,
            "7": 5156,
            "8": 5249,
            "9": 5398,
            "10": 5516,
            "11": 5623,
            "12": 5672,
            "13": 5829,
            "14": 5927,
            "15": 6076,
            "16": 6233,
            "17": 6410,
            "18": 6556,
            "19": 6744,
            "20": 6875,
            "21": 6975,
            "22": 7110,
            "23": 7294,
            "24": 7422,
            "25": 7509,
            "26": 7610,
            "27": 7793,
            "28": 7871
        },
        "3": {
            "1": 7921,
            "2": 8008,
            "3": 8136,
            "4": 8216,
            "5": 8350,
            "6": 8534,
            "7": 8626,
            "8": 8714,
            "9": 8870,
            "10": 8987,
            "11": 9074,
            "12": 9178,
            "13": 9239,
            "14": 9328,
            "15": 9418,
            "16": 9461,
            "17": 9536,
            "18": 9647,
            "19": 9744,
            "20": 9782,
            "21": 9894,
            "22": 10001,
            "23": 10146,
            "24": 10251,
            "25": 10318,
            "26": 10381,
            "27": 10461,
            "28": 10580,
            "29": 10666,
            "30": 10773,
            "31": 10839,
            "32": 10932,
            "33": 11039,
            "34": 11086,
            "35": 11187
        },
        "4": {
            "1": 11251,
            "2": 11457,
            "3": 11523,
            "4": 11567,
            "5": 11658,
            "6": 11770,
            "7": 11866,
            "8": 11966,
            "9": 12100,
            "10": 12160,
            "11": 12246,
            "12": 12376,
            "13": 12524,
            "14": 12627,
            "15": 12653,
            "16": 12803,
            "17": 12890,
            "18": 13027,
            "19": 13085,
            "20": 13226,
            "21": 13370,
            "22": 13484,
            "23": 13601,
            "24": 13645,
            "25": 13764,
            "26": 13865,
            "27": 13956,
            "28": 14058,
            "29": 14162,
            "30": 14249,
            "31": 14356,
            "32": 14428,
            "33": 14564,
            "34": 14655,
            "35": 14783,
            "36": 14873,
            "37": 14987,
            "38": 15079,
            "39": 15205,
            "40": 15327,
            "41": 15406
        },
        "5": {
            "1": 15503,
            "2": 15561,
            "3": 15654,
            "4": 15741,
            "5": 15888,
            "6": 15981,
            "7": 16062,
            "8": 16191,
            "9": 16261,
            "10": 16356,
            "11": 16426,
            "12": 16483,
            "13": 16560,
            "14": 16740,
            "15": 16868,
            "16": 17026,
            "17": 17142,
            "18": 17207,
            "19": 17303,
            "20": 17448,
            "21": 17569,
            "22": 17702,
            "23": 17801,
            "24": 17938,
            "25": 18009,
            "26": 18082,
            "27": 18216,
            "28": 18303,
            "29": 18373,
            "30": 18470,
            "31": 18594,
            "32": 18703,
            "33": 18757,
            "34": 18885,
            "35": 18986,
            "36": 19153,
            "37": 19230,
            "38": 19314,
            "39": 19428,
            "40": 19529,
            "41": 19689,
            "42": 19798,
            "43": 19922
        },
        "6": {
            "1": 20025,
            "2": 20098,
            "3": 20342,
            "4": 20505,
            "5": 20623,
            "6": 20716,
            "7": 20811,
            "8": 20920,
            "9": 21036,
            "10": 21073,
            "11": 21139,
            "12": 21275,
            "13": 21329,
            "14": 21412,
            "15": 21602,
            "16": 21714,
            "17": 21806,
            "18": 21985,
            "19": 22076,
            "20": 22166,
            "21": 22333,
            "22": 22482,
            "23": 22657,
            "24": 22750,
            "25": 22857,
            "26": 22992,
            "27": 23104,
            "28": 23219,
            "29": 23319,
            "30": 23402,
            "31": 23487,
            "32": 23665,
            "33": 23728,
            "34": 23838,
            "35": 23994,
            "36": 24127,
            "37": 24250,
            "38": 24438,
            "39": 24546,
            "40": 24633,
            "41": 24685,
            "42": 24897,
            "43": 24930,
            "44": 25012,
            "45": 25067,
            "46": 25189,
            "47": 25247,
            "48": 25331,
            "49": 25502,
            "50": 25590,
            "51": 25716,
            "52": 25810,
            "53": 25884,
            "54": 25958,
            "55": 26020,
            "56": 26118
        },
        "7": {
            "1": 26317,
            "2": 26417,
            "3": 26508,
            "4": 26642,
            "5": 26804,
            "6": 26980,
            "7": 27148,
            "8": 27218,
            "9": 27298,
            "10": 27415,
            "11": 27534,
            "12": 27669,
            "13": 27737,
            "14": 27850,
            "15": 27942,
            "16": 28064,
            "17": 28065,
            "18": 28160,
            "19": 28272,
            "20": 28408,
            "21": 28470,
            "22": 28576,
            "23": 28655,
            "24": 28710,
            "25": 28864,
            "26": 28996,
            "27": 29102,
            "28": 29235,
            "29": 29315,
            "30": 29399,
            "31": 29471,
            "32": 29597,
            "33": 29720,
            "34": 29852,
            "35": 29950,
            "36": 30042,
            "37": 30144
        },
        "8": {
            "1": 30278,
            "2": 30401,
            "3": 30505,
            "4": 30613,
            "5": 30712,
            "6": 30779,
            "7": 30968,
            "8": 31075,
            "9": 31199,
            "10": 31262,
            "11": 31340,
            "12": 31440,
            "13": 31557,
            "14": 31630,
            "15": 31726,
            "16": 31821,
            "17": 31902,
            "18": 32053,
            "19": 32138,
            "20": 32262,
            "21": 32392,
            "22": 32440,
            "23": 32531,
            "24": 32695,
            "25": 32771,
            "26": 32902,
            "27": 32965,
            "28": 33091,
            "29": 33192,
            "30": 33286,
            "31": 33334,
            "32": 33544,
            "33": 33623,
            "34": 33799,
            "35": 33959,
            "36": 34079,
            "37": 34156,
            "38": 34208
        },
        "9": {
            "1": 34390,
            "2": 34540,
            "3": 34696,
            "4": 34782,
            "5": 34860,
            "6": 34996,
            "7": 35052,
            "8": 35171,
            "9": 35256,
            "10": 35402,
            "11": 35484,
            "12": 35570,
            "13": 35724,
            "14": 35841,
            "15": 35962,
            "16": 36055,
            "17": 36105,
            "18": 36226,
            "19": 36408,
            "20": 36542,
            "21": 36701,
            "22": 36796,
            "23": 36911,
            "24": 36986,
            "25": 37072,
            "26": 37253,
            "27": 37378,
            "28": 37454,
            "29": 37551,
            "30": 37604,
            "31": 37704,
            "32": 37880,
            "33": 37959,
            "34": 38067,
            "35": 38150,
            "36": 38276,
            "37": 38373,
            "38": 38514,
            "39": 38640,
            "40": 38763,
            "41": 38804,
            "42": 38941,
            "43": 39132,
            "44": 39290,
            "45": 39291,
            "46": 39434,
            "47": 39435,
            "48": 39597,
            "49": 39676,
            "50": 39711
        },
        "10": {
            "1": 39854,
            "2": 40013,
            "3": 40105,
            "4": 40147,
            "5": 40235,
            "6": 40320,
            "7": 40387,
            "8": 40470,
            "9": 40548,
            "10": 40610,
            "11": 40683,
            "12": 40782,
            "13": 40862,
            "14": 40976,
            "15": 41142,
            "16": 41249,
            "17": 41330,
            "18": 41481,
            "19": 41558,
            "20": 41751,
            "21": 41818,
            "22": 41997,
            "23": 42073,
            "24": 42179,
            "25": 42296,
            "26": 42414,
            "27": 42500,
            "28": 42614,
            "29": 42676,
            "30": 42824,
            "31": 43006,
            "32": 43064,
            "33": 43283,
            "34": 43488,
            "35": 43578,
            "36": 43699,
            "37": 43746,
            "38": 43836,
            "39": 43970,
            "40": 44100,
            "41": 44219,
            "42": 44293,
            "43": 44468,
            "44": 44556,
            "45": 44608,
            "46": 44717,
            "47": 44917,
            "48": 45022,
            "49": 45128,
            "50": 45241,
            "51": 45308,
            "52": 45406
        },
        "11": {
            "1": 45524,
            "2": 45644,
            "3": 45810,
            "4": 45918,
            "5": 46006,
            "6": 46081,
            "7": 46150,
            "8": 46232,
            "9": 46334,
            "10": 46449,
            "11": 46535,
            "12": 46695,
            "13": 46756,
            "14": 46929,
            "15": 47035,
            "16": 47240,
            "17": 47315,
            "18": 47470,
            "19": 47641,
            "20": 47706,
            "21": 47789,
            "22": 47878,
            "23": 47915,
            "24": 48107,
            "25": 48218,
            "26": 48355,
            "27": 48356,
            "28": 48510,
            "29": 48611,
            "30": 48730,
            "31": 48795,
            "32": 48915,
            "33": 49027
        },
        "12": {
            "1": 49151,
            "2": 49374,
            "3": 49479,
            "4": 49541,
            "5": 49640,
            "6": 49754,
            "7": 49863,
            "8": 49977,
            "9": 50045,
            "10": 50160,
            "11": 50270,
            "12": 50333,
            "13": 50552,
            "14": 50640,
            "15": 50906,
            "16": 51058,
            "17": 51172,
            "18": 51291,
            "19": 51374,
            "20": 51549,
            "21": 51641,
            "22": 51743,
            "23": 51822,
            "24": 51904,
            "25": 52001,
            "26": 52111,
            "27": 52301,
            "28": 52376,
            "29": 52557,
            "30": 52661,
            "31": 52779,
            "32": 52878,
            "33": 52989,
            "34": 53176,
            "35": 53337,
            "36": 53468,
            "37": 53624,
            "38": 53731,
            "39": 53888,
            "40": 53977,
            "41": 54084,
            "42": 54256,
            "43": 54342,
            "44": 54471
        },
        "13": {
            "1": 54580,
            "2": 54713,
            "3": 54845,
            "4": 54961,
            "5": 55070,
            "6": 55127,
            "7": 55198,
            "8": 55314,
            "9": 55474,
            "10": 55660,
            "11": 55714,
            "12": 55898,
            "13": 56031,
            "14": 56123,
            "15": 56293,
            "16": 56369,
            "17": 56421,
            "18": 56499,
            "19": 56545,
            "20": 56683,
            "21": 56822,
            "22": 56931,
            "23": 57052,
            "24": 57115,
            "25": 57230,
            "26": 57309,
            "27": 57399,
            "28": 57524,
            "29": 57653,
            "30": 57744,
            "31": 57845,
            "32": 57913,
            "33": 58020,
            "34": 58085,
            "35": 58242,
            "36": 58410,
            "37": 58466
        },
        "14": {
            "1": 58516,
            "2": 58698,
            "3": 58766,
            "4": 58981,
            "5": 59071,
            "6": 59188,
            "7": 59285,
            "8": 59399,
            "9": 59490,
            "10": 59618,
            "11": 59709,
            "12": 59825,
            "13": 60041,
            "14": 60168,
            "15": 60301,
            "16": 60395,
            "17": 60511,
            "18": 60561,
            "19": 60690,
            "20": 60771,
            "21": 60853,
            "22": 61010,
            "23": 61160,
            "24": 61258,
            "25": 61341,
            "26": 61469,
            "27": 61534,
            "28": 61665,
            "29": 61727,
            "30": 61780,
            "31": 61909,
            "32": 62035,
            "33": 62133,
            "34": 62230,
            "35": 62335,
            "36": 62439,
            "37": 62561,
            "38": 62702,
            "39": 62807,
            "40": 62857,
            "41": 62975,
            "42": 63143,
            "43": 63185,
            "44": 63366,
            "45": 63487,
            "46": 63548,
            "47": 63587,
            "48": 63698,
            "49": 63799,
            "50": 63922,
            "51": 63959,
            "52": 64052,
            "53": 64095,
            "54": 64212,
            "55": 64352,
            "56": 64498,
            "57": 64570,
            "58": 64632,
            "59": 64762,
            "60": 64807,
            "61": 64961,
            "62": 65091,
            "63": 65225,
            "64": 65306,
            "65": 65400,
            "66": 65543,
            "67": 65636,
            "68": 65752,
            "69": 65867,
            "70": 65975,
            "71": 66106,
            "72": 66204
        },
        "15": {
            "1": 66403,
            "2": 66598,
            "3": 66679,
            "4": 66725,
            "5": 66828,
            "6": 66882,
            "7": 66969,
            "8": 67073,
            "9": 67144,
            "10": 67215,
            "11": 67304,
            "12": 67388,
            "13": 67476,
            "14": 67505,
            "15": 67603,
            "16": 67726,
            "17": 67847,
            "18": 67937,
            "19": 67998,
            "20": 68121,
            "21": 68251,
            "22": 68407,
            "23": 68495,
            "24": 68564,
            "25": 68656,
            "26": 68708,
            "27": 68781,
            "28": 68855,
            "29": 68856,
            "30": 69004,
            "31": 69049,
            "32": 69198,
            "33": 69350,
            "34": 69423,
            "35": 69577,
            "36": 69664,
            "37": 69841,
            "38": 69883,
            "39": 69945,
            "40": 70068,
            "41": 70206,
            "42": 70343,
            "43": 70431,
            "44": 70584,
            "45": 70704,
            "46": 70783,
            "47": 70961
        },
        "16": {
            "1": 71031,
            "2": 71170,
            "3": 71266,
            "4": 71355,
            "5": 71449,
            "6": 71570,
            "7": 71724,
            "8": 71849,
            "9": 71973,
            "10": 72102,
            "11": 72183,
            "12": 72272,
            "13": 72372,
            "14": 72454,
            "15": 72631,
            "16": 72710,
            "17": 72806,
            "18": 72927,
            "19": 73104,
            "20": 73210
        }
    }
}